{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|begin_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|eot_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|start_header_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|end_header_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "system",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "user",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "assistant",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|begin_of_text|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<|begin_of_text|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|begin_of_text|>",
          "type_id": 1
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|begin_of_text|>": {
        "id": "<|begin_of_text|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|begin_of_text|>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|begin_of_text|>": 0,
      "<|eot_id|>": 1,
      "<|start_header_id|>": 2,
      "<|end_header_id|>": 3,
      "system": 4,
      "user": 5,
      "assistant": 6,
      "<unk>": 7,
      "<pad>": 8,
      "<mask>": 9,
      "\u0001": 10,
      "\u0002": 11,
      "\u0007": 12,
      "\t": 13,
      "\n": 14,
      "\u0010": 15,
      "\u001e": 16,
      "!": 17,
      "\"": 18,
      "#": 19,
      "$": 20,
      "%": 21,
      "&": 22,
      "'": 23,
      "(": 24,
      ")": 25,
      "*": 26,
      "+": 27,
      ",": 28,
      "-": 29,
      ".": 30,
      "/": 31,
      "0": 32,
      "1": 33,
      "2": 34,
      "3": 35,
      "4": 36,
      "5": 37,
      "6": 38,
      "7": 39,
      "8": 40,
      "9": 41,
      ":": 42,
      ";": 43,
      "<": 44,
      "=": 45,
      ">": 46,
      "?": 47,
      "@": 48,
      "A": 49,
      "B": 50,
      "C": 51,
      "D": 52,
      "E": 53,
      "F": 54,
      "G": 55,
      "H": 56,
      "I": 57,
      "J": 58,
      "K": 59,
      "L": 60,
      "M": 61,
      "N": 62,
      "O": 63,
      "P": 64,
      "Q": 65,
      "R": 66,
      "S": 67,
      "T": 68,
      "U": 69,
      "V": 70,
      "W": 71,
      "X": 72,
      "Y": 73,
      "Z": 74,
      "[": 75,
      "\\": 76,
      "]": 77,
      "^": 78,
      "_": 79,
      "`": 80,
      "a": 81,
      "b": 82,
      "c": 83,
      "d": 84,
      "e": 85,
      "f": 86,
      "g": 87,
      "h": 88,
      "i": 89,
      "j": 90,
      "k": 91,
      "l": 92,
      "m": 93,
      "n": 94,
      "o": 95,
      "p": 96,
      "q": 97,
      "r": 98,
      "s": 99,
      "t": 100,
      "u": 101,
      "v": 102,
      "w": 103,
      "x": 104,
      "y": 105,
      "z": 106,
      "{": 107,
      "}": 108,
      "~": 109,
      "¢": 110,
      "£": 111,
      "¤": 112,
      "¥": 113,
      "¦": 114,
      "§": 115,
      "©": 116,
      "«": 117,
      "­": 118,
      "®": 119,
      "°": 120,
      "±": 121,
      "¶": 122,
      "·": 123,
      "»": 124,
      "×": 125,
      "÷": 126,
      "Œ": 127,
      "œ": 128,
      "ˆ": 129,
      "́": 130,
      "̄": 131,
      "̈": 132,
      "̧": 133,
      "μ": 134,
      "،": 135,
      "؍": 136,
      "؎": 137,
      "ؑ": 138,
      "ؓ": 139,
      "؛": 140,
      "؟": 141,
      "ء": 142,
      "آ": 143,
      "أ": 144,
      "ؤ": 145,
      "إ": 146,
      "ئ": 147,
      "ا": 148,
      "ب": 149,
      "ة": 150,
      "ت": 151,
      "ث": 152,
      "ج": 153,
      "ح": 154,
      "خ": 155,
      "د": 156,
      "ذ": 157,
      "ر": 158,
      "ز": 159,
      "س": 160,
      "ش": 161,
      "ص": 162,
      "ض": 163,
      "ط": 164,
      "ظ": 165,
      "ع": 166,
      "غ": 167,
      "ـ": 168,
      "ف": 169,
      "ق": 170,
      "ك": 171,
      "ل": 172,
      "م": 173,
      "ن": 174,
      "ه": 175,
      "و": 176,
      "ى": 177,
      "ي": 178,
      "ً": 179,
      "ٌ": 180,
      "ٍ": 181,
      "َ": 182,
      "ُ": 183,
      "ِ": 184,
      "ّ": 185,
      "ْ": 186,
      "٠": 187,
      "١": 188,
      "٢": 189,
      "٣": 190,
      "٤": 191,
      "٥": 192,
      "٦": 193,
      "٧": 194,
      "٨": 195,
      "٩": 196,
      "ٰ": 197,
      "ٹ": 198,
      "پ": 199,
      "چ": 200,
      "ڈ": 201,
      "ڑ": 202,
      "ژ": 203,
      "ک": 204,
      "گ": 205,
      "ں": 206,
      "ھ": 207,
      "ہ": 208,
      "ۂ": 209,
      "ۃ": 210,
      "ی": 211,
      "ے": 212,
      "۔": 213,
      "۱": 214,
      "۲": 215,
      "۳": 216,
      "۴": 217,
      "​": 218,
      "‌": 219,
      "‍": 220,
      "‏": 221,
      "—": 222,
      "‘": 223,
      "’": 224,
      "‚": 225,
      "“": 226,
      "”": 227,
      "„": 228,
      "†": 229,
      "‡": 230,
      "•": 231,
      "‰": 232,
      "‹": 233,
      "›": 234,
      "⁄": 235,
      "€": 236,
      "←": 237,
      "∞": 238,
      "∣": 239,
      "∴": 240,
      "≥": 241,
      "⊂": 242,
      "⌖": 243,
      "▁": 244,
      "□": 245,
      "⟨": 246,
      "⦗": 247,
      "⦘": 248,
      "⮙": 249,
      "﷜": 250,
      "﷤": 251,
      "ال": 252,
      "▁ال": 253,
      "▁و": 254,
      "▁م": 255,
      "▁أ": 256,
      "▁ب": 257,
      "▁ف": 258,
      "▁ع": 259,
      "َا": 260,
      "َّ": 261,
      "▁ل": 262,
      "▁ي": 263,
      "▁\n": 264,
      "ِي": 265,
      "َل": 266,
      "▁ق": 267,
      "▁إ": 268,
      "ان": 269,
      "▁في": 270,
      "▁وَ": 271,
      "َن": 272,
      "▁ت": 273,
      "له": 274,
      "▁الْ": 275,
      "▁ك": 276,
      "هُ": 277,
      "▁من": 278,
      "▁ح": 279,
      "لا": 280,
      "اب": 281,
      "ما": 282,
      "لى": 283,
      "َي": 284,
      "ُو": 285,
      "▁الم": 286,
      "ين": 287,
      "ها": 288,
      "هِ": 289,
      "لي": 290,
      "▁ر": 291,
      "نَ": 292,
      "▁(": 293,
      "▁وال": 294,
      "َة": 295,
      "▁س": 296,
      "َيْ": 297,
      "▁.": 298,
      "َر": 299,
      "▁بن": 300,
      "َم": 301,
      "نا": 302,
      "ِن": 303,
      "▁ه": 304,
      "▁الله": 305,
      "وا": 306,
      "َال": 307,
      "▁ص": 308,
      "َب": 309,
      "▁عن": 310,
      "َو": 311,
      "ير": 312,
      "ار": 313,
      "▁-": 314,
      "▁أن": 315,
      "َع": 316,
      "هم": 317,
      "لم": 318,
      "َد": 319,
      "بي": 320,
      "▁ج": 321,
      "▁الأ": 322,
      "ِّ": 323,
      "ذا": 324,
      "ْت": 325,
      "ون": 326,
      "▁،": 327,
      "ول": 328,
      "َى": 329,
      "▁على": 330,
      "َنْ": 331,
      "▁\nو": 332,
      "▁بِ": 333,
      "ية": 334,
      "▁ش": 335,
      "▁ن": 336,
      "ْن": 337,
      "را": 338,
      "▁فِي": 339,
      "َق": 340,
      "ْر": 341,
      "ْل": 342,
      "ًا": 343,
      "لَّ": 344,
      "▁ذ": 345,
      "▁ا": 346,
      "▁علي": 347,
      "ِنْ": 348,
      "ُّ": 349,
      "▁الن": 350,
      "▁الح": 351,
      "▁عَل": 352,
      "▁\"": 353,
      "ْم": 354,
      "▁قال": 355,
      "لك": 356,
      "َت": 357,
      "ــ": 358,
      "▁ث": 359,
      "▁الت": 360,
      "ري": 361,
      "▁خ": 362,
      "▁\n(": 363,
      "دي": 364,
      "ِل": 365,
      "▁الع": 366,
      "▁١": 367,
      "▁لا": 368,
      "▁اب": 369,
      "قال": 370,
      "هَا": 371,
      "حم": 372,
      "▁ما": 373,
      "َك": 374,
      "▁الس": 375,
      "▁د": 376,
      "ام": 377,
      "اء": 378,
      "▁بال": 379,
      "▁الْم": 380,
      "َهُ": 381,
      "▁[": 382,
      "مْ": 383,
      "▁الق": 384,
      "▁وأ": 385,
      "▁اللَّ": 386,
      "ات": 387,
      "▁عليه": 388,
      "▁الر": 389,
      "َس": 390,
      "َالَ": 391,
      "▁الش": 392,
      "من": 393,
      "مر": 394,
      "ِهِ": 395,
      "ست": 396,
      "▁:": 397,
      "قد": 398,
      "كر": 399,
      "ور": 400,
      "َح": 401,
      "▁غ": 402,
      "بد": 403,
      "سلم": 404,
      "في": 405,
      "ته": 406,
      "اد": 407,
      "▁الص": 408,
      "▁ابن": 409,
      "إن": 410,
      "▁٢": 411,
      "▁مِنْ": 412,
      "أن": 413,
      "▁إلى": 414,
      "ائ": 415,
      "ة،": 416,
      "▁وه": 417,
      "َةِ": 418,
      "ْد": 419,
      "َوْ": 420,
      "خر": 421,
      "َلَّ": 422,
      "▁أو": 423,
      "َذ": 424,
      "▁ط": 425,
      "بو": 426,
      "▁بْن": 427,
      "مع": 428,
      "ِك": 429,
      "▁مُ": 430,
      "عد": 431,
      "َف": 432,
      "▁{": 433,
      "ه،": 434,
      "يد": 435,
      "▁وَال": 436,
      "▁كان": 437,
      "َج": 438,
      "▁الد": 439,
      "َنَّ": 440,
      "▁الب": 441,
      "▁مع": 442,
      "مَا": 443,
      "ُل": 444,
      "َّا": 445,
      "حمد": 446,
      "ْب": 447,
      "يل": 448,
      "▁يُ": 449,
      "ني": 450,
      "َيْهِ": 451,
      "َأ": 452,
      "▁الج": 453,
      "وله": 454,
      "▁أي": 455,
      "▁الك": 456,
      "اً": 457,
      "▁عَنْ": 458,
      "حد": 459,
      "▁الإ": 460,
      "يم": 461,
      "كم": 462,
      "وم": 463,
      "ُهُ": 464,
      "بر": 465,
      "▁أبي": 466,
      "▁قَالَ": 467,
      "▁ز": 468,
      "▁إِ": 469,
      "▁«": 470,
      "▁عبد": 471,
      "ــــ": 472,
      "ُم": 473,
      "▁٣": 474,
      "َّة": 475,
      "ود": 476,
      "▁وَل": 477,
      "َاء": 478,
      "فر": 479,
      "ِر": 480,
      "▁الذ": 481,
      "▁لل": 482,
      "ِم": 483,
      "▁إن": 484,
      "فع": 485,
      "ِ،": 486,
      "َاب": 487,
      "▁عَلَى": 488,
      "▁ذلك": 489,
      "▁عَلَيْهِ": 490,
      "لام": 491,
      "َانَ": 492,
      "ديث": 493,
      "▁آ": 494,
      "ُر": 495,
      "▁تع": 496,
      "َار": 497,
      "با": 498,
      "١)": 499,
      "▁هذا": 500,
      "▁أَب": 501,
      "ْع": 502,
      "▁به": 503,
      "َه": 504,
      "رب": 505,
      "َص": 506,
      "َان": 507,
      "▁لم": 508,
      "ُوا": 509,
      "ُول": 510,
      "ِع": 511,
      "▁وسلم": 512,
      "▁الخ": 513,
      "ِب": 514,
      "▁له": 515,
      "▁قال:": 516,
      "شر": 517,
      "حي": 518,
      "▁..": 519,
      "لف": 520,
      "▁أبو": 521,
      "▁وك": 522,
      "▁ولا": 523,
      "َام": 524,
      "لة": 525,
      "اه": 526,
      "جه": 527,
      "ذه": 528,
      "َةَ": 529,
      "▁وع": 530,
      "▁صلى": 531,
      "▁\nال": 532,
      "اع": 533,
      "▁وي": 534,
      "▁/": 535,
      "▁الْح": 536,
      "▁وق": 537,
      "وَ": 538,
      "َمْ": 539,
      "َخ": 540,
      "▁وت": 541,
      "سن": 542,
      "قي": 543,
      "ُونَ": 544,
      "▁الف": 545,
      "كون": 546,
      "▁الْمُ": 547,
      "▁مَا": 548,
      "▁وهو": 549,
      "٢)": 550,
      "▁٤": 551,
      "▁لِ": 552,
      "▁...": 553,
      "ِنَّ": 554,
      "▁الط": 555,
      "رف": 556,
      "ِد": 557,
      "لت": 558,
      "▁الث": 559,
      "اني": 560,
      "▁وا": 561,
      "مَ": 562,
      "▁ثم": 563,
      "فس": 564,
      "الى": 565,
      "ِينَ": 566,
      "يب": 567,
      "َةُ": 568,
      "َنَا": 569,
      "▁أَنَّ": 570,
      "سم": 571,
      "▁هو": 572,
      "▁نَ": 573,
      "رو": 574,
      "عة": 575,
      "▁يق": 576,
      "▁اللَّهُ": 577,
      "َرْ": 578,
      "▁ان": 579,
      "▁الز": 580,
      "ِكَ": 581,
      "▁يع": 582,
      "▁لأن": 583,
      "اف": 584,
      "لق": 585,
      "▁بِال": 586,
      "َض": 587,
      "جل": 588,
      "▁وم": 589,
      "اق": 590,
      "صل": 591,
      "▁الْع": 592,
      "▁تعالى": 593,
      "ٍ،": 594,
      "▁محمد": 595,
      "▁إِل": 596,
      "َدَّ": 597,
      "َوْل": 598,
      "رة": 599,
      "َاد": 600,
      "ْف": 601,
      "ْح": 602,
      "ُمْ": 603,
      "▁وَس": 604,
      "ضي": 605,
      "▁بع": 606,
      "لو": 607,
      "▁الآ": 608,
      "هما": 609,
      "▁اللَّهِ": 610,
      "نة": 611,
      "نى": 612,
      "سول": 613,
      "رج": 614,
      "تاب": 615,
      "▁بْنُ": 616,
      "إِ": 617,
      "▁إذا": 618,
      "▁مِ": 619,
      "▁الْأ": 620,
      "▁أَنْ": 621,
      "بل": 622,
      "▁غير": 623,
      "َيْر": 624,
      "▁الو": 625,
      "َط": 626,
      "بة": 627,
      "َذَا": 628,
      "▁لي": 629,
      "▁قد": 630,
      "▁وَق": 631,
      "▁فيه": 632,
      "▁ض": 633,
      "▁وَأ": 634,
      "ْي": 635,
      "َش": 636,
      "▁أَوْ": 637,
      "▁بعد": 638,
      "٣)": 639,
      "▁قَالَ:": 640,
      "مة": 641,
      "▁فإن": 642,
      "▁أنه": 643,
      "ْو": 644,
      "▁الْق": 645,
      "▁إلا": 646,
      "▁كَانَ": 647,
      "ْق": 648,
      "▁فقال": 649,
      "▁لَا": 650,
      "▁بين": 651,
      "َلَّى": 652,
      "َلِكَ": 653,
      "رك": 654,
      "خت": 655,
      "▁عمر": 656,
      "ذلك": 657,
      "هُوَ": 658,
      "ْس": 659,
      "صر": 660,
      "▁لَهُ": 661,
      "▁النَّ": 662,
      "ه.": 663,
      "وي": 664,
      "َات": 665,
      "ِيل": 666,
      "نِ": 667,
      "وس": 668,
      "▁٥": 669,
      "مي": 670,
      "كن": 671,
      "▁}": 672,
      "اري": 673,
      "اج": 674,
      "هل": 675,
      "▁الذي": 676,
      "ْك": 677,
      "▁بْنِ": 678,
      "▁عَن": 679,
      "ُن": 680,
      "رض": 681,
      "تى": 682,
      "لب": 683,
      "▁قوله": 684,
      "▁كما": 685,
      "ِير": 686,
      "▁صَلَّى": 687,
      "ظر": 688,
      "▁رسول": 689,
      "▁وقال": 690,
      "ــــــــ": 691,
      "عم": 692,
      "▁\n(١)": 693,
      "اح": 694,
      "ابن": 695,
      "هر": 696,
      "تح": 697,
      "▁وج": 698,
      "ِيُّ": 699,
      "▁وب": 700,
      "َتْ": 701,
      "ذَا": 702,
      "▁وَسَلَّ": 703,
      "▁حد": 704,
      "▁والم": 705,
      "قة": 706,
      "▁عَب": 707,
      "غير": 708,
      "تب": 709,
      "▁وفي": 710,
      "دة": 711,
      "َرَ": 712,
      "َائ": 713,
      "▁عند": 714,
      "▁\"ال": 715,
      "َز": 716,
      "▁وَسَلَّمَ": 717,
      "َّل": 718,
      "َّد": 719,
      "▁(١": 720,
      "▁إلي": 721,
      "▁فَق": 722,
      "▁عنه": 723,
      "▁النا": 724,
      "سْت": 725,
      "▁وس": 726,
      "وج": 727,
      "عل": 728,
      "▁\nف": 729,
      "▁كل": 730,
      "▁لأ": 731,
      "وف": 732,
      "▁\nأ": 733,
      "▁وإن": 734,
      "ِّي": 735,
      "▁هذه": 736,
      "▁أخ": 737,
      "وع": 738,
      "▁فأ": 739,
      "▁إِلَى": 740,
      "▁المع": 741,
      "تم": 742,
      "▁فَ": 743,
      "▁\nق": 744,
      "ْرِ": 745,
      "▁أم": 746,
      "▁ذكر": 747,
      "ِيَّة": 748,
      "▁ول": 749,
      "وب": 750,
      "▁الَّ": 751,
      "ِيَ": 752,
      "▁وقد": 753,
      "▁مِنَ": 754,
      "ها،": 755,
      "▁الا": 756,
      "▁فَل": 757,
      "ثنا": 758,
      "يا": 759,
      "٤)": 760,
      "جر": 761,
      "▁حديث": 762,
      "َّر": 763,
      "َدَّث": 764,
      "ة.": 765,
      "مُ": 766,
      "صح": 767,
      "▁\n١": 768,
      "َهَا": 769,
      "ُب": 770,
      "َدْ": 771,
      "ُك": 772,
      "َاف": 773,
      "▁وإ": 774,
      "مان": 775,
      "َعْ": 776,
      "َاع": 777,
      "▁أَبِي": 778,
      "ضع": 779,
      "راء": 780,
      "▁ظ": 781,
      "▁يكون": 782,
      "▁شي": 783,
      "ده": 784,
      "وق": 785,
      "▁يج": 786,
      "سب": 787,
      "▁ابْن": 788,
      "▁يت": 789,
      "▁بِهِ": 790,
      "▁ين": 791,
      "▁بعض": 792,
      "لّ": 793,
      "ذكر": 794,
      "▁أع": 795,
      "َاح": 796,
      "ماء": 797,
      "فة": 798,
      "بت": 799,
      "▁ومن": 800,
      "َسُول": 801,
      "▁الْب": 802,
      "ِيد": 803,
      "ُ:": 804,
      "▁٦": 805,
      "يت": 806,
      "ورة": 807,
      "▁ور": 808,
      "مس": 809,
      "▁أَح": 810,
      "▁اللَّه": 811,
      "▁عَبْد": 812,
      "وى": 813,
      "ِيِّ": 814,
      "▁أحمد": 815,
      "▁\n(٢)": 816,
      "▁لِل": 817,
      "▁[١": 818,
      "▁حَدَّث": 819,
      "إِنْ": 820,
      "قول": 821,
      "ُق": 822,
      "حا": 823,
      "▁وَي": 824,
      "▁است": 825,
      "▁الغ": 826,
      "َ،": 827,
      "به": 828,
      "حيح": 829,
      "▁ون": 830,
      "َةٌ": 831,
      "ُ،": 832,
      "▁حتى": 833,
      "َث": 834,
      "َةً": 835,
      "▁ذَلِكَ": 836,
      "هد": 837,
      "▁التي": 838,
      "وز": 839,
      "ِق": 840,
      "تي": 841,
      "▁رَسُول": 842,
      "▁الْج": 843,
      "حَم": 844,
      "ُمَّ": 845,
      "ّا": 846,
      "▁)": 847,
      "▁الرَّ": 848,
      "هُمْ": 849,
      "َاق": 850,
      "▁أَبُو": 851,
      "يف": 852,
      "▁مَع": 853,
      "در": 854,
      "▁الْو": 855,
      "كان": 856,
      "▁التَّ": 857,
      "بع": 858,
      "قر": 859,
      "ْج": 860,
      "ين،": 861,
      "ًا،": 862,
      "▁النبي": 863,
      "سان": 864,
      "ُد": 865,
      "▁الَّذ": 866,
      "▁وما": 867,
      "ُس": 868,
      "▁الْف": 869,
      "إِنَّ": 870,
      "حت": 871,
      "▁لَمْ": 872,
      "▁الحديث": 873,
      "قت": 874,
      "حر": 875,
      "٥)": 876,
      "▁بل": 877,
      "▁أحد": 878,
      "▁\n[": 879,
      "مل": 880,
      "▁فى": 881,
      "قم": 882,
      "▁إس": 883,
      "▁القر": 884,
      "ْتُ": 885,
      "ْط": 886,
      "▁وكان": 887,
      "▁أَن": 888,
      "ثر": 889,
      "▁أخر": 890,
      "وت": 891,
      "ِهَا": 892,
      "ِف": 893,
      "هو": 894,
      "▁نا": 895,
      "َوْم": 896,
      "▁\nقال": 897,
      "▁روا": 898,
      "▁مَنْ": 899,
      "مام": 900,
      "راد": 901,
      "▁والت": 902,
      "▁تَع": 903,
      "حَمَّد": 904,
      "سر": 905,
      "الك": 906,
      "الم": 907,
      "خل": 908,
      "▁الْك": 909,
      "أَنَّ": 910,
      "▁أهل": 911,
      "ليل": 912,
      "ثير": 913,
      "قط": 914,
      "▁مث": 915,
      "▁سنة": 916,
      "حو": 917,
      "▁مت": 918,
      "َغ": 919,
      "اص": 920,
      "شي": 921,
      "َمَا": 922,
      "لاث": 923,
      "ريق": 924,
      "▁كتاب": 925,
      "▁٧": 926,
      "▁(٢": 927,
      "▁وَك": 928,
      "ِح": 929,
      "َةٍ": 930,
      "▁فِيهِ": 931,
      "َدِي": 932,
      "▁هَذَا": 933,
      "قل": 934,
      "▁وَع": 935,
      "ِس": 936,
      "لَّا": 937,
      "▁حَدَّثَنَا": 938,
      "َيْنِ": 939,
      "▁منه": 940,
      "ْص": 941,
      "لها": 942,
      "▁المن": 943,
      "▁مُحَمَّد": 944,
      "▁أَيْ": 945,
      "▁يقول": 946,
      "٢]": 947,
      "ِيم": 948,
      "َاءِ": 949,
      "بير": 950,
      "ِت": 951,
      "▁وَهُوَ": 952,
      "▁مس": 953,
      "▁الْخ": 954,
      "از": 955,
      "▁والأ": 956,
      "▁يد": 957,
      "ْه": 958,
      "ه:": 959,
      "ِنْد": 960,
      "قوله": 961,
      "آن": 962,
      "▁ولم": 963,
      "▁بها": 964,
      "سي": 965,
      "▁يَق": 966,
      "َّى": 967,
      "▁فيها": 968,
      "ُف": 969,
      "رأ": 970,
      "ْنَ": 971,
      "هم،": 972,
      "لاة": 973,
      "َمَّا": 974,
      "ُون": 975,
      "ُج": 976,
      "▁ثُمَّ": 977,
      "▁بَيْ": 978,
      "ُع": 979,
      "▁الناس": 980,
      "ُور": 981,
      "جم": 982,
      "▁وح": 983,
      "▁بأ": 984,
      "▁وابن": 985,
      "٦)": 986,
      "َعْد": 987,
      "دين": 988,
      "▁فلا": 989,
      "كل": 990,
      "▁وَم": 991,
      "▁وَلَا": 992,
      "ادة": 993,
      "▁وأن": 994,
      "راه": 995,
      "▁*": 996,
      "َّاس": 997,
      "▁\n٢": 998,
      "▁أَخ": 999,
      "عت": 1000,
      "َاهُ": 1001,
      "▁سب": 1002,
      "دا": 1003,
      "ِ.": 1004,
      "▁[١]": 1005,
      "ْخ": 1006,
      "صف": 1007,
      "▁الل": 1008,
      "▁حدثنا": 1009,
      "▁عَنِ": 1010,
      "▁٨": 1011,
      "ٌ،": 1012,
      "▁\n(٣)": 1013,
      "▁يوم": 1014,
      "▁فل": 1015,
      "لاف": 1016,
      "▁الي": 1017,
      "ذي": 1018,
      "▁مح": 1019,
      "سلام": 1020,
      "قدم": 1021,
      "▁الض": 1022,
      "▁السَّ": 1023,
      "▁يا": 1024,
      "▁أَنَّهُ": 1025,
      "خرج": 1026,
      "فق": 1027,
      "اط": 1028,
      "كَ": 1029,
      "ماع": 1030,
      "▁قَال": 1031,
      "▁عِنْد": 1032,
      "▁(١)": 1033,
      "▁يَك": 1034,
      "▁الشي": 1035,
      "▁هُوَ": 1036,
      "رد": 1037,
      "▁شر": 1038,
      "باس": 1039,
      "ية،": 1040,
      "َلَ": 1041,
      "رم": 1042,
      "زل": 1043,
      "زم": 1044,
      "▁\n{": 1045,
      "لاً": 1046,
      "▁بد": 1047,
      "▁الصَّ": 1048,
      "▁إل": 1049,
      "بار": 1050,
      "▁\nوال": 1051,
      "▁قول": 1052,
      "وال": 1053,
      "▁فَأ": 1054,
      "▁واحد": 1055,
      "٧)": 1056,
      "وه": 1057,
      "▁المؤ": 1058,
      "▁لما": 1059,
      "▁غَيْر": 1060,
      "جد": 1061,
      "عيد": 1062,
      "يس": 1063,
      "▁الظ": 1064,
      "▁يح": 1065,
      "زي": 1066,
      "▁رضي": 1067,
      "َدِيث": 1068,
      "فت": 1069,
      "َاج": 1070,
      "▁والن": 1071,
      "٣]": 1072,
      "▁[ال": 1073,
      "▁بم": 1074,
      "▁باب": 1075,
      "سل": 1076,
      "▁رأ": 1077,
      "واب": 1078,
      "حة": 1079,
      "▁ليس": 1080,
      "▁قبل": 1081,
      "▁الشَّ": 1082,
      "▁مو": 1083,
      "شت": 1084,
      "▁الوا": 1085,
      "▁الآية": 1086,
      "▁وَج": 1087,
      "إذا": 1088,
      "تَّ": 1089,
      "▁قَوْل": 1090,
      "▁إِنَّ": 1091,
      "▁٩": 1092,
      "َانِ": 1093,
      "▁فَقَالَ": 1094,
      "ضل": 1095,
      "▁المت": 1096,
      "َاة": 1097,
      "َنِي": 1098,
      "▁المس": 1099,
      "▁ثنا": 1100,
      "▁,": 1101,
      "خذ": 1102,
      "▁إليه": 1103,
      "▁أيض": 1104,
      "يات": 1105,
      "الة": 1106,
      "▁لاَ": 1107,
      "▁النَّب": 1108,
      "▁أس": 1109,
      "▁كثير": 1110,
      "حق": 1111,
      "▁بي": 1112,
      "▁أمر": 1113,
      "نَّ": 1114,
      "▁(ال": 1115,
      "ْأ": 1116,
      "▁لو": 1117,
      "▁بكر": 1118,
      "اس": 1119,
      "ْلِ": 1120,
      "▁فقال:": 1121,
      "▁نفس": 1122,
      "▁مسلم": 1123,
      "٨)": 1124,
      "▁آخر": 1125,
      "▁وغير": 1126,
      "▁\nوقال": 1127,
      "▁تعالى:": 1128,
      "يث": 1129,
      "َلْ": 1130,
      "َيْس": 1131,
      "▁بأن": 1132,
      "▁البي": 1133,
      "رق": 1134,
      "لاء": 1135,
      "ان،": 1136,
      "خاري": 1137,
      "▁وَف": 1138,
      "▁القرآن": 1139,
      "ِيع": 1140,
      "▁فَي": 1141,
      "َالَى": 1142,
      "ُود": 1143,
      "َاس": 1144,
      "▁وهذا": 1145,
      "▁رج": 1146,
      "▁فت": 1147,
      "ــــــــــــــــ": 1148,
      "▁دا": 1149,
      "▁لِأَنَّ": 1150,
      "▁لأنه": 1151,
      "▁١٠": 1152,
      "صد": 1153,
      "َيْن": 1154,
      "رير": 1155,
      "▁إِذَا": 1156,
      "عن": 1157,
      "َتَّى": 1158,
      "ارة": 1159,
      "ي،": 1160,
      "َرَّ": 1161,
      "▁عَنْهُ": 1162,
      "▁رقم": 1163,
      "▁مِنْهُ": 1164,
      "َرِي": 1165,
      "▁{و": 1166,
      "َرُ": 1167,
      "ِث": 1168,
      "▁إب": 1169,
      "اَ": 1170,
      "▁يس": 1171,
      "٩)": 1172,
      "▁وف": 1173,
      "▁اللهُ": 1174,
      "ْنَا": 1175,
      "قات": 1176,
      "▁لهم": 1177,
      "▁أب": 1178,
      "اهر": 1179,
      "▁بَعْد": 1180,
      "صب": 1181,
      "يل:": 1182,
      "▁الرحم": 1183,
      "▁وَه": 1184,
      "▁شَيْ": 1185,
      "رى": 1186,
      "٠)": 1187,
      "▁وَت": 1188,
      "ضِ": 1189,
      "▁كانت": 1190,
      "▁وهي": 1191,
      "▁(٢)": 1192,
      "▁الَّذِي": 1193,
      "تها": 1194,
      "اة": 1195,
      "بِ": 1196,
      "▁تَعَالَى": 1197,
      "▁قَب": 1198,
      "▁أخرجه": 1199,
      "▁يَع": 1200,
      "▁[٢]": 1201,
      "▁\n٣": 1202,
      "▁\nوأ": 1203,
      "وان": 1204,
      "▁الحسن": 1205,
      "▁(٣": 1206,
      "ليس": 1207,
      "َبَ": 1208,
      "▁بما": 1209,
      "▁طريق": 1210,
      "عر": 1211,
      "راهيم": 1212,
      "▁أي:": 1213,
      "كُمْ": 1214,
      "▁حَتَّى": 1215,
      "▁الأن": 1216,
      "▁تح": 1217,
      "دم": 1218,
      "معنى": 1219,
      "َاي": 1220,
      "َنِ": 1221,
      "▁أَو": 1222,
      "ِهِمْ": 1223,
      "▁سعيد": 1224,
      "▁اله": 1225,
      "▁للم": 1226,
      "تُ": 1227,
      "▁صحيح": 1228,
      "▁مر": 1229,
      "▁عَبْدِ": 1230,
      "▁بَيْنَ": 1231,
      "ٍّ": 1232,
      "▁المص": 1233,
      "َيِّ": 1234,
      "▁جاء": 1235,
      "▁وخ": 1236,
      "▁وَر": 1237,
      "▁شيء": 1238,
      "امة": 1239,
      "▁البخاري": 1240,
      "▁كَمَا": 1241,
      "الح": 1242,
      "ميع": 1243,
      "▁١/": 1244,
      "▁هي": 1245,
      "َيَّ": 1246,
      "٤]": 1247,
      "عب": 1248,
      "▁(و": 1249,
      "طي": 1250,
      "فعل": 1251,
      "ضر": 1252,
      "وة": 1253,
      "ِين": 1254,
      "▁١٩": 1255,
      "▁١١": 1256,
      "▁قت": 1257,
      "َعَ": 1258,
      "▁يست": 1259,
      "▁مج": 1260,
      "َاءَ": 1261,
      "▁مثل": 1262,
      "▁القا": 1263,
      "ى،": 1264,
      "▁الدين": 1265,
      "▁يَح": 1266,
      "خْت": 1267,
      "ُهَا": 1268,
      "عي": 1269,
      "▁مالك": 1270,
      "▁يَج": 1271,
      "قص": 1272,
      "▁منها": 1273,
      "ْتَ": 1274,
      "▁فهو": 1275,
      "د،": 1276,
      "▁يم": 1277,
      "ئة": 1278,
      "▁كُل": 1279,
      "ِهِ،": 1280,
      "وح": 1281,
      "▁٢/": 1282,
      "▁ثلاث": 1283,
      "▁فال": 1284,
      "▁يَت": 1285,
      "ِ:": 1286,
      "ِيّ": 1287,
      "▁هـ": 1288,
      "فظ": 1289,
      "▁إذ": 1290,
      "▁أح": 1291,
      "▁١٢": 1292,
      "▁داود": 1293,
      "صحاب": 1294,
      "▁رَب": 1295,
      "▁١٣": 1296,
      "▁الأم": 1297,
      "▁الرحمن": 1298,
      "▁سمع": 1299,
      "جب": 1300,
      "ينا": 1301,
      "َمْر": 1302,
      "ة:": 1303,
      "▁انظر": 1304,
      "▁لها": 1305,
      "دل": 1306,
      "َاو": 1307,
      "تق": 1308,
      "▁عباس": 1309,
      "▁؛": 1310,
      "▁أك": 1311,
      "▁إِلَّا": 1312,
      "▁عشر": 1313,
      "ْمُ": 1314,
      "َهُمْ": 1315,
      "ذهب": 1316,
      "فسير": 1317,
      "▁الإسلام": 1318,
      "▁فَإِنَّ": 1319,
      "▁يأ": 1320,
      "▁الأَ": 1321,
      "ًّا": 1322,
      "▁والع": 1323,
      "َرِ": 1324,
      "وفي": 1325,
      "▁الأول": 1326,
      "م،": 1327,
      "▁قوله:": 1328,
      "كت": 1329,
      "▁\n(٤)": 1330,
      "▁عمرو": 1331,
      "▁الثَّ": 1332,
      "▁أص": 1333,
      "▁أش": 1334,
      "يّ": 1335,
      "ٌّ": 1336,
      "▁كال": 1337,
      "فا": 1338,
      "▁سورة": 1339,
      "▁أخبر": 1340,
      "▁ابْنُ": 1341,
      "▁علم": 1342,
      "نت": 1343,
      "▁النس": 1344,
      "▁الذين": 1345,
      "▁يز": 1346,
      "▁عُم": 1347,
      "طر": 1348,
      "َمُ": 1349,
      "لت:": 1350,
      "▁وص": 1351,
      "ذر": 1352,
      "ائل": 1353,
      "▁فقد": 1354,
      "تْ": 1355,
      "َابِ": 1356,
      "▁وأبو": 1357,
      "▁مَال": 1358,
      "انه": 1359,
      "َاز": 1360,
      "▁قب": 1361,
      "اريخ": 1362,
      "َيْد": 1363,
      "فتح": 1364,
      "▁ولك": 1365,
      "راً": 1366,
      "حيى": 1367,
      "عا": 1368,
      "▁بر": 1369,
      "▁\nب": 1370,
      "▁وَإِنْ": 1371,
      "َّةِ": 1372,
      "▁حم": 1373,
      "▁١٤": 1374,
      "هب": 1375,
      "ُص": 1376,
      "ُوس": 1377,
      "ْمِ": 1378,
      "وض": 1379,
      "ْبَر": 1380,
      "ولى": 1381,
      "▁إبراهيم": 1382,
      "َيْسَ": 1383,
      "مت": 1384,
      "▁فق": 1385,
      "▁والح": 1386,
      "فْس": 1387,
      "ُخ": 1388,
      "▁هنا": 1389,
      "ها.": 1390,
      "▁يَوْم": 1391,
      "هي": 1392,
      "َةِ،": 1393,
      "▁رجل": 1394,
      "وات": 1395,
      "▁فع": 1396,
      "▁وجه": 1397,
      "▁يَس": 1398,
      "▁أق": 1399,
      "َكَ": 1400,
      "كة": 1401,
      "▁وَفِي": 1402,
      "ذب": 1403,
      "▁هُ": 1404,
      "ين.": 1405,
      "ابة": 1406,
      "َةَ،": 1407,
      "▁زيد": 1408,
      "ُوب": 1409,
      "ند": 1410,
      "▁السلام": 1411,
      "نف": 1412,
      "ِّر": 1413,
      "مه": 1414,
      "الب": 1415,
      "▁عِنْدَ": 1416,
      "َارِ": 1417,
      "▁رب": 1418,
      "▁بح": 1419,
      "ُه": 1420,
      "▁بك": 1421,
      "٥]": 1422,
      "غة": 1423,
      "▁العلم": 1424,
      "َلا": 1425,
      "▁أَه": 1426,
      "َدَ": 1427,
      "▁(٤": 1428,
      "إِذَا": 1429,
      "▁يش": 1430,
      "َاهِ": 1431,
      "سْل": 1432,
      "وص": 1433,
      "▁وَب": 1434,
      "ا،": 1435,
      "ْث": 1436,
      "َِنَّ": 1437,
      "ْض": 1438,
      "ِيح": 1439,
      "▁رواه": 1440,
      "▁مَعَ": 1441,
      "َاتِ": 1442,
      "▁\n*": 1443,
      "▁\nوَق": 1444,
      "جز": 1445,
      "▁الاست": 1446,
      "صار": 1447,
      "▁\nت": 1448,
      "▁اسْت": 1449,
      "نس": 1450,
      "َاض": 1451,
      "ِص": 1452,
      "▁الصلاة": 1453,
      "▁فيما": 1454,
      "اش": 1455,
      "ماً": 1456,
      "▁[٣]": 1457,
      "نه": 1458,
      "▁يقال": 1459,
      "افع": 1460,
      "لهم": 1461,
      "َظ": 1462,
      "▁أَي": 1463,
      "▁اللهِ": 1464,
      "ِه": 1465,
      "▁يخ": 1466,
      "قه": 1467,
      "▁أنا": 1468,
      "▁\n٤": 1469,
      "▁أَص": 1470,
      "▁وَقَالَ": 1471,
      "▁اخت": 1472,
      "▁حال": 1473,
      "▁فر": 1474,
      "▁\nقوله": 1475,
      "حاق": 1476,
      "َامِ": 1477,
      "▁يَقُول": 1478,
      "َلَا": 1479,
      "▁تأ": 1480,
      "قب": 1481,
      "▁اسم": 1482,
      "ته،": 1483,
      "▁منهم": 1484,
      "▁\nم": 1485,
      "َاص": 1486,
      "احب": 1487,
      "غني": 1488,
      "ريب": 1489,
      "ثم": 1490,
      "▁مص": 1491,
      "َعْض": 1492,
      "دع": 1493,
      "▁\nع": 1494,
      "▁الخط": 1495,
      "ْز": 1496,
      "ِبُ": 1497,
      "ْهُ": 1498,
      "▁يعني": 1499,
      "رائ": 1500,
      "نَا": 1501,
      "▁وان": 1502,
      "▁الأرض": 1503,
      "قَوْل": 1504,
      "فِع": 1505,
      "▁الدَّ": 1506,
      "▁المسلم": 1507,
      "▁جع": 1508,
      "▁قَبْل": 1509,
      "▁موس": 1510,
      "ُهُمْ": 1511,
      "▁دون": 1512,
      "▁عم": 1513,
      "ِيق": 1514,
      "ضم": 1515,
      "▁الكتاب": 1516,
      "▁تن": 1517,
      "▁مما": 1518,
      "▁أَحْم": 1519,
      "ثمان": 1520,
      "▁١٨": 1521,
      "تِ": 1522,
      "▁عليهم": 1523,
      "طلق": 1524,
      "هار": 1525,
      "غَيْر": 1526,
      "ِيَّةِ": 1527,
      "وط": 1528,
      "انية": 1529,
      "ناه": 1530,
      "ذيب": 1531,
      "▁يحيى": 1532,
      "الث": 1533,
      "َاه": 1534,
      "▁النَّاس": 1535,
      "▁ولو": 1536,
      "ريد": 1537,
      "▁نس": 1538,
      "▁لك": 1539,
      "▁الشيخ": 1540,
      "▁رحم": 1541,
      "▁عَلَيْ": 1542,
      "▁ترج": 1543,
      "▁الفر": 1544,
      "▁روى": 1545,
      "▁وَالْم": 1546,
      "▁الإِ": 1547,
      "▁فإذا": 1548,
      "▁رَج": 1549,
      "▁سن": 1550,
      "▁(٣)": 1551,
      "▁مست": 1552,
      "تِي": 1553,
      "▁الْإِ": 1554,
      "▁تَق": 1555,
      "▁جميع": 1556,
      "لفظ": 1557,
      "▁الآخر": 1558,
      "▁١٥": 1559,
      "▁فِيهَا": 1560,
      "▁وَمَا": 1561,
      "▁يك": 1562,
      "َمِ": 1563,
      "▁رَض": 1564,
      "است": 1565,
      "طل": 1566,
      "▁والله": 1567,
      "هذا": 1568,
      "مال": 1569,
      "▁بِأ": 1570,
      "ِيلَ": 1571,
      "ُح": 1572,
      "َاحِد": 1573,
      "▁يُق": 1574,
      "اهد": 1575,
      "َرْب": 1576,
      "▁بت": 1577,
      "▁الإن": 1578,
      "▁بإ": 1579,
      "▁عام": 1580,
      "ظم": 1581,
      "▁الحق": 1582,
      "▁١٧": 1583,
      "▁الإمام": 1584,
      "▁حسن": 1585,
      "ُوع": 1586,
      "ربي": 1587,
      "َاط": 1588,
      "اء،": 1589,
      "▁تق": 1590,
      "▁(أ": 1591,
      "لال": 1592,
      "َّب": 1593,
      "▁وش": 1594,
      "نيا": 1595,
      "▁إنما": 1596,
      "▁سَم": 1597,
      "▁حق": 1598,
      "▁١٦": 1599,
      "إِن": 1600,
      "بيد": 1601,
      "خص": 1602,
      "لمة": 1603,
      "شْت": 1604,
      "ضى": 1605,
      "▁الله،": 1606,
      "▁بَعْدَ": 1607,
      "صلى": 1608,
      "▁يكن": 1609,
      "▁\n•": 1610,
      "ًا.": 1611,
      "▁الحج": 1612,
      "▁يجوز": 1613,
      "ْنِ": 1614,
      "▁أد": 1615,
      "▁ابْنِ": 1616,
      "ديد": 1617,
      "▁والإ": 1618,
      "هـ": 1619,
      "▁عز": 1620,
      "▁لابن": 1621,
      "يمان": 1622,
      "ّة": 1623,
      "▁«ال": 1624,
      "ُونُ": 1625,
      "▁أَحَد": 1626,
      "▁مِن": 1627,
      "٢،": 1628,
      "▁خال": 1629,
      "▁لأَِنَّ": 1630,
      "لاق": 1631,
      "▁بالم": 1632,
      "١،": 1633,
      "ْذ": 1634,
      "▁الْغ": 1635,
      "طب": 1636,
      "▁جمع": 1637,
      "ربع": 1638,
      "▁يَد": 1639,
      "▁\"أ": 1640,
      "٣،": 1641,
      "َمَ": 1642,
      "َذِهِ": 1643,
      "▁يَا": 1644,
      "▁الأصل": 1645,
      "▁رَسُولُ": 1646,
      "▁الَّذِينَ": 1647,
      "▁]": 1648,
      "لط": 1649,
      "▁فك": 1650,
      "تد": 1651,
      "يع": 1652,
      "يه": 1653,
      "ك،": 1654,
      "▁إِس": 1655,
      "▁فلم": 1656,
      "▁إلَى": 1657,
      "▁الرجل": 1658,
      "٥،": 1659,
      "▁إِنْ": 1660,
      "٠،": 1661,
      "▁أبا": 1662,
      "ِيَّ": 1663,
      "٤،": 1664,
      "اً،": 1665,
      "▁وَح": 1666,
      "▁فإنه": 1667,
      "فَ": 1668,
      "تهى": 1669,
      "٦،": 1670,
      "».": 1671,
      "▁أج": 1672,
      "ِيب": 1673,
      "▁الأمر": 1674,
      "▁لَك": 1675,
      "روف": 1676,
      "طع": 1677,
      "▁بِم": 1678,
      "تَ": 1679,
      "▁معنى": 1680,
      "٩،": 1681,
      "ائر": 1682,
      "َعَل": 1683,
      "ِيَّةُ": 1684,
      "٧،": 1685,
      "ْظ": 1686,
      "▁رواية": 1687,
      "▁قُل": 1688,
      "َّافِع": 1689,
      "▁الملك": 1690,
      "ةِ": 1691,
      "▁الشر": 1692,
      "تين": 1693,
      "▁المؤمن": 1694,
      "▁وز": 1695,
      "▁يؤ": 1696,
      "٨،": 1697,
      "▁أَع": 1698,
      "ريم": 1699,
      "َالِ": 1700,
      "ْتِ": 1701,
      "▁موسى": 1702,
      "▁دار": 1703,
      "واء": 1704,
      "▁سبح": 1705,
      "ائي": 1706,
      "▁دين": 1707,
      "طف": 1708,
      "▁عليها": 1709,
      "٦]": 1710,
      "َاءُ": 1711,
      "▁كلام": 1712,
      "ذك": 1713,
      "▁(١/": 1714,
      "افظ": 1715,
      "تهم": 1716,
      "ثبت": 1717,
      "▁حيث": 1718,
      "ْلُ": 1719,
      "خرجه": 1720,
      "▁أف": 1721,
      "قيق": 1722,
      "▁حَدِيث": 1723,
      "▁سعد": 1724,
      "▁لَوْ": 1725,
      "▁حب": 1726,
      "▁تس": 1727,
      "▁نحو": 1728,
      "▁ير": 1729,
      "▁أصحاب": 1730,
      "▁سَب": 1731,
      "▁ضع": 1732,
      "▁حين": 1733,
      "▁المح": 1734,
      "▁مق": 1735,
      "▁قَدْ": 1736,
      "▁الرَّح": 1737,
      "زة": 1738,
      "ْنِي": 1739,
      "روى": 1740,
      "▁وذلك": 1741,
      "ُذ": 1742,
      "ُط": 1743,
      "▁سلي": 1744,
      "كام": 1745,
      "ثل": 1746,
      "لائ": 1747,
      "▁تقدم": 1748,
      "سنا": 1749,
      "▁أعلم": 1750,
      "▁عد": 1751,
      "وية": 1752,
      "▁\n-": 1753,
      "عه": 1754,
      "▁مش": 1755,
      "▁بذلك": 1756,
      "َدُ": 1757,
      "لية": 1758,
      "رمذي": 1759,
      "▁\nوفي": 1760,
      "باد": 1761,
      "▁فعل": 1762,
      "اله": 1763,
      "▁لت": 1764,
      "▁بخ": 1765,
      "حدث": 1766,
      "بق": 1767,
      "َبِ": 1768,
      "▁فَإِنْ": 1769,
      "▁ولكن": 1770,
      "▁٢٠": 1771,
      "▁حكم": 1772,
      "ُوف": 1773,
      "▁وإنما": 1774,
      "▁ذا": 1775,
      "▁بَعْض": 1776,
      "سين": 1777,
      "▁أَخْبَر": 1778,
      "زُ": 1779,
      "▁لِي": 1780,
      "▁عل": 1781,
      "ءِ": 1782,
      "▁إسحاق": 1783,
      "▁إِن": 1784,
      "▁العرب": 1785,
      "لاَّ": 1786,
      "▁سي": 1787,
      "▁بق": 1788,
      "▁أول": 1789,
      "▁اللَّهَ": 1790,
      "واه": 1791,
      "▁نع": 1792,
      "بيه": 1793,
      "مات": 1794,
      "▁بني": 1795,
      "َّع": 1796,
      "▁يقول:": 1797,
      "▁الثاني": 1798,
      "ٍ:": 1799,
      "▁شيئ": 1800,
      "▁(٥": 1801,
      "▁صاحب": 1802,
      "▁\n٥": 1803,
      "هم.": 1804,
      "ذن": 1805,
      "▁مَس": 1806,
      "▁(٢/": 1807,
      "▁الْي": 1808,
      "ُت": 1809,
      "▁خير": 1810,
      "ّه": 1811,
      "ُرْ": 1812,
      "▁هم": 1813,
      "ُض": 1814,
      "▁القول": 1815,
      "▁يَنْ": 1816,
      "ذَلِكَ": 1817,
      "▁عَم": 1818,
      "فار": 1819,
      "▁رَضِيَ": 1820,
      "▁ود": 1821,
      "َلُ": 1822,
      "ِش": 1823,
      "▁الحكم": 1824,
      "▁٣/": 1825,
      "نع": 1826,
      "▁تكون": 1827,
      "▁فَت": 1828,
      "َتِهِ": 1829,
      "قوله:": 1830,
      "مش": 1831,
      "▁الأس": 1832,
      "▁فلما": 1833,
      "▁شرح": 1834,
      "▁الزَّ": 1835,
      "▁ات": 1836,
      "▁\n(٥)": 1837,
      "▁واست": 1838,
      "▁هرير": 1839,
      "▁الدنيا": 1840,
      "▁ذكره": 1841,
      "▁صد": 1842,
      "▁يص": 1843,
      "▁وَقَدْ": 1844,
      "▁[٤]": 1845,
      "▁الكلام": 1846,
      "اية": 1847,
      "▁الْآ": 1848,
      "▁٢١": 1849,
      "َّار": 1850,
      "▁ومع": 1851,
      "▁يُع": 1852,
      "▁السُّ": 1853,
      "فه": 1854,
      "ويل": 1855,
      "داد": 1856,
      "▁فس": 1857,
      "رات": 1858,
      "سْلِم": 1859,
      "▁شَيْء": 1860,
      "▁وَلاَ": 1861,
      "▁المج": 1862,
      "ُهُ:": 1863,
      "▁فَلَا": 1864,
      "▁المست": 1865,
      "▁وقال:": 1866,
      "ُث": 1867,
      "▁جَم": 1868,
      "َرْض": 1869,
      "▁تص": 1870,
      "--": 1871,
      "▁ها": 1872,
      "ِئ": 1873,
      "▁٢٢": 1874,
      "َعِيد": 1875,
      "▁رَأ": 1876,
      "شد": 1877,
      "افر": 1878,
      "▁بِهَا": 1879,
      "▁أر": 1880,
      "▁إِلَيْهِ": 1881,
      "اك": 1882,
      "▁وث": 1883,
      "ِيف": 1884,
      "ذاب": 1885,
      "▁وَاحِد": 1886,
      "▁وليس": 1887,
      "ِيُّ،": 1888,
      "▁خلق": 1889,
      "ابع": 1890,
      "ُوم": 1891,
      "ظهر": 1892,
      "▁لع": 1893,
      "▁وعلى": 1894,
      "ِط": 1895,
      "▁قوم": 1896,
      "اعة": 1897,
      "ْرُ": 1898,
      "▁أَس": 1899,
      "▁وأما": 1900,
      "▁أَك": 1901,
      "ؤْم": 1902,
      "▁كَال": 1903,
      "▁وسلم-": 1904,
      "سند": 1905,
      "▁والش": 1906,
      "رت": 1907,
      "▁أما": 1908,
      "▁تَح": 1909,
      "يام": 1910,
      "انِي": 1911,
      "َّه": 1912,
      "▁٢٣": 1913,
      "▁إذَا": 1914,
      "▁مُع": 1915,
      "ْدِ": 1916,
      "ونه": 1917,
      "عود": 1918,
      "نَى": 1919,
      "▁فَقَالَ:": 1920,
      "ْتُمْ": 1921,
      "َعُ": 1922,
      "١]": 1923,
      "▁أَق": 1924,
      "ٍ.": 1925,
      "▁\nي": 1926,
      "▁عَبْدُ": 1927,
      "ان:": 1928,
      "ضاء": 1929,
      "٧]": 1930,
      "▁كتب": 1931,
      "امع": 1932,
      "سة": 1933,
      "لَّهِ": 1934,
      "▁وعن": 1935,
      "▁حَق": 1936,
      "▁وقيل": 1937,
      "َدِ": 1938,
      "▁لكن": 1939,
      "بيع": 1940,
      "ملة": 1941,
      "▁مؤ": 1942,
      "بغ": 1943,
      "تك": 1944,
      "اذ": 1945,
      "ب،": 1946,
      "▁الرا": 1947,
      "مير": 1948,
      "لاح": 1949,
      "له،": 1950,
      "▁العل": 1951,
      "ظيم": 1952,
      "▁(ف": 1953,
      "▁أَم": 1954,
      "▁وَكَانَ": 1955,
      "حتاج": 1956,
      "جة": 1957,
      "▁هَذِهِ": 1958,
      "▁والك": 1959,
      "َدِّ": 1960,
      "بيل": 1961,
      "▁\nك": 1962,
      "س،": 1963,
      "لاد": 1964,
      "▁يزيد": 1965,
      "▁وسلم:": 1966,
      "خبر": 1967,
      "هن": 1968,
      "ختلف": 1969,
      "وء": 1970,
      "َقَ": 1971,
      "َاك": 1972,
      "▁ترك": 1973,
      "▁قالوا": 1974,
      "▁عائ": 1975,
      "▁به.": 1976,
      "▁فَك": 1977,
      "وائ": 1978,
      "▁الَّتِي": 1979,
      "أنه": 1980,
      "▁خَل": 1981,
      "▁تك": 1982,
      "▁بالأ": 1983,
      "▁مات": 1984,
      "▁وبين": 1985,
      "▁رِ": 1986,
      "َابُ": 1987,
      "▁ألف": 1988,
      "▁سَمِع": 1989,
      "عام": 1990,
      "▁وَنَ": 1991,
      "▁مخ": 1992,
      "▁المد": 1993,
      "ألة": 1994,
      "▁يَأ": 1995,
      "ضاف": 1996,
      "َيْل": 1997,
      "▁عبيد": 1998,
      "شة": 1999,
      "دينة": 2000,
      "▁أكثر": 2001,
      "▁انتهى": 2002,
      "▁فن": 2003,
      "مائ": 2004,
      "ماعة": 2005,
      "▁بِمَا": 2006,
      "▁بمعنى": 2007,
      "▁الأع": 2008,
      "مار": 2009,
      "ي:": 2010,
      "بري": 2011,
      "▁٢٤": 2012,
      "ناء": 2013,
      "فص": 2014,
      "▁الِ": 2015,
      "▁حدث": 2016,
      "▁وَلَمْ": 2017,
      "َبُ": 2018,
      "▁أَج": 2019,
      "أل": 2020,
      "اتم": 2021,
      "▁وط": 2022,
      "▁كانوا": 2023,
      "▁عُمَرَ": 2024,
      "▁المش": 2025,
      "▁رَسُولَ": 2026,
      "ْرٍ": 2027,
      "ُز": 2028,
      "▁مِث": 2029,
      "▁قر": 2030,
      "▁))": 2031,
      "▁كذا": 2032,
      "▁الْحَن": 2033,
      "▁\"و": 2034,
      "شرح": 2035,
      "ِرِ": 2036,
      "ِلَ": 2037,
      "▁\nول": 2038,
      "▁وإذا": 2039,
      "▁بَك": 2040,
      "▁والق": 2041,
      "يرة": 2042,
      "بين": 2043,
      "▁الرَّحْم": 2044,
      "▁٢٥": 2045,
      "▁وآ": 2046,
      "▁قل": 2047,
      "▁الأص": 2048,
      "هور": 2049,
      "تع": 2050,
      "▁الشافع": 2051,
      "▁والس": 2052,
      "▁أنها": 2053,
      "ؤْمِن": 2054,
      "▁والج": 2055,
      "▁ملك": 2056,
      "َلِك": 2057,
      "▁النِّ": 2058,
      "ثُ": 2059,
      "▁الأولى": 2060,
      "▁إِب": 2061,
      "▁والص": 2062,
      "▁الصح": 2063,
      "َهُوَ": 2064,
      "ره": 2065,
      "▁مُحَمَّدُ": 2066,
      "▁\nقَالَ": 2067,
      "َامُ": 2068,
      "▁جعفر": 2069,
      "▁\nل": 2070,
      "▁زي": 2071,
      "▁(٦": 2072,
      "ابت": 2073,
      "▁القاسم": 2074,
      "▁عق": 2075,
      "▁((": 2076,
      "▁\nح": 2077,
      "جع": 2078,
      "▁لله": 2079,
      "▁وهم": 2080,
      "▁وَلَوْ": 2081,
      "َادَ": 2082,
      "ق،": 2083,
      "ليه": 2084,
      "▁تَك": 2085,
      "▁٢٨": 2086,
      "َفَ": 2087,
      "▁سبحانه": 2088,
      "▁رحمه": 2089,
      "▁به،": 2090,
      "▁نَفْس": 2091,
      "َامَ": 2092,
      "ون،": 2093,
      "▁مِم": 2094,
      "رام": 2095,
      "ٌ.": 2096,
      "▁وَص": 2097,
      "َانُ": 2098,
      "ية.": 2099,
      "وسف": 2100,
      "عمال": 2101,
      "▁\nوقد": 2102,
      "▁خط": 2103,
      "▁٤/": 2104,
      "▁وَالْح": 2105,
      "▁الدُّ": 2106,
      "▁بط": 2107,
      "َذَلِكَ": 2108,
      "▁وجل": 2109,
      "▁نفسه": 2110,
      "▁تلك": 2111,
      "▁نز": 2112,
      "يبة": 2113,
      "▁أبى": 2114,
      "▁قيل": 2115,
      "▁٢٧": 2116,
      "▁نص": 2117,
      "▁مد": 2118,
      "▁\n٦": 2119,
      "▁سليمان": 2120,
      "َلِّ": 2121,
      "▁وَا": 2122,
      "▁لَيْسَ": 2123,
      "▁تخ": 2124,
      "▁عثمان": 2125,
      "▁٢٦": 2126,
      "َافِ": 2127,
      "رفة": 2128,
      "▁موضع": 2129,
      "ِيهِ": 2130,
      "▁تج": 2131,
      "▁تفسير": 2132,
      "يز": 2133,
      "▁إنه": 2134,
      "▁رَجُل": 2135,
      "▁الْمَال": 2136,
      "ّ،": 2137,
      "▁ذلك،": 2138,
      "بات": 2139,
      "ِلا": 2140,
      "▁مك": 2141,
      "▁وقوله": 2142,
      "هود": 2143,
      "▁صالح": 2144,
      "قدير": 2145,
      "▁لِأَنَّهُ": 2146,
      "١.": 2147,
      "صور": 2148,
      "▁المعنى": 2149,
      "ابر": 2150,
      "▁خمس": 2151,
      "▁أخبرنا": 2152,
      "▁والب": 2153,
      "حن": 2154,
      "راءة": 2155,
      "▁كذلك": 2156,
      "َتِ": 2157,
      "▁امر": 2158,
      "▁إِلاَّ": 2159,
      "▁\nومن": 2160,
      "▁التع": 2161,
      "ْنُ": 2162,
      "▁الحافظ": 2163,
      "▁يُح": 2164,
      "دت": 2165,
      "ْرَاه": 2166,
      "ماعيل": 2167,
      "بال": 2168,
      "راف": 2169,
      "ُوزُ": 2170,
      "▁عَد": 2171,
      "▁-صلى": 2172,
      "▁الأخ": 2173,
      "▁ذَك": 2174,
      "وجه": 2175,
      "َمَّ": 2176,
      "▁والخ": 2177,
      "َهُ،": 2178,
      "زيز": 2179,
      "▁أُم": 2180,
      "وبة": 2181,
      "▁لفظ": 2182,
      "سط": 2183,
      "قول:": 2184,
      "فل": 2185,
      "فاء": 2186,
      "▁\n\"": 2187,
      "ريف": 2188,
      "▁إلَّا": 2189,
      "مته": 2190,
      "▁وقيل:": 2191,
      "▁يَص": 2192,
      "▁المنا": 2193,
      "٨]": 2194,
      "▁أخذ": 2195,
      "ِرُ": 2196,
      "لوب": 2197,
      "▁سَعِيد": 2198,
      "▁أه": 2199,
      "▁الشَّي": 2200,
      "▁اع": 2201,
      "▁وله": 2202,
      "ان.": 2203,
      "▁المط": 2204,
      "▁الكبير": 2205,
      "▁٢٩": 2206,
      "▁والد": 2207,
      "ِّب": 2208,
      "▁والث": 2209,
      "▁وذكر": 2210,
      "▁لن": 2211,
      "▁وَإِ": 2212,
      "▁كُن": 2213,
      "▁٣٠": 2214,
      "َرَج": 2215,
      "▁مال": 2216,
      ".\"": 2217,
      "▁وقت": 2218,
      "يلة": 2219,
      "▁وتع": 2220,
      "▁الصحيح": 2221,
      "قا": 2222,
      "ُوهُ": 2223,
      "▁الشَّافِع": 2224,
      "▁\nقوله:": 2225,
      "رح": 2226,
      "▁انظر:": 2227,
      "▁لِم": 2228,
      "َفْع": 2229,
      "▁بغ": 2230,
      "▁الحا": 2231,
      "ؤلاء": 2232,
      "ْش": 2233,
      "▁\"م": 2234,
      "سا": 2235,
      "ِذ": 2236,
      "▁يل": 2237,
      "حب": 2238,
      "▁فض": 2239,
      "▁النَّبِيِّ": 2240,
      "ينة": 2241,
      "▁بنُ": 2242,
      "ْرَأ": 2243,
      "ِيرِ": 2244,
      "ضا": 2245,
      "▁(م": 2246,
      "ّر": 2247,
      "▁(٤)": 2248,
      "▁صف": 2249,
      "يار": 2250,
      "٢.": 2251,
      "▁مِنْهَا": 2252,
      "ونَ": 2253,
      "▁بش": 2254,
      "ها:": 2255,
      "▁يَخ": 2256,
      "▁أت": 2257,
      "▁شع": 2258,
      "▁\n(١": 2259,
      "ماد": 2260,
      "ع،": 2261,
      "▁\nثم": 2262,
      "َ:": 2263,
      "ل،": 2264,
      "َعْنَى": 2265,
      "فى": 2266,
      "▁بالت": 2267,
      "▁فما": 2268,
      "▁ار": 2269,
      "▁أنس": 2270,
      "▁النار": 2271,
      "▁عليه،": 2272,
      "ِز": 2273,
      "▁الماء": 2274,
      "ذف": 2275,
      "▁أيضا": 2276,
      "▁تت": 2277,
      "ُمُ": 2278,
      "▁أَخْبَرَنَا": 2279,
      "َاةِ": 2280,
      "▁وكذلك": 2281,
      "ال،": 2282,
      "٣.": 2283,
      "ولي": 2284,
      "▁سفي": 2285,
      "َسَن": 2286,
      "▁\nس": 2287,
      "▁(ص": 2288,
      "▁الجمع": 2289,
      "وك": 2290,
      "▁اس": 2291,
      "ِلْك": 2292,
      "ِّل": 2293,
      "▁لمن": 2294,
      "▁الْمَس": 2295,
      "صة": 2296,
      "▁أَر": 2297,
      "ِّين": 2298,
      "ْتَم": 2299,
      "▁أَمْ": 2300,
      "قدر": 2301,
      "▁آخ": 2302,
      "َّن": 2303,
      "▁لَهُمْ": 2304,
      "▁الإنسان": 2305,
      "ارث": 2306,
      "▁خبر": 2307,
      "▁[١].": 2308,
      "▁بهذا": 2309,
      "ءُ": 2310,
      "▁حاتم": 2311,
      "▁اج": 2312,
      "▁مَالِك": 2313,
      "▁هريرة": 2314,
      "ْرَ": 2315,
      "▁فتح": 2316,
      "َارَ": 2317,
      "▁وَسَلَّمَ:": 2318,
      "َّةَ": 2319,
      "ِّف": 2320,
      "▁جز": 2321,
      "ِبِ": 2322,
      "▁تم": 2323,
      "▁أَش": 2324,
      "ُونَ}": 2325,
      "فرد": 2326,
      "..": 2327,
      "▁اهـ": 2328,
      "نب": 2329,
      "ِرَ": 2330,
      "▁؟": 2331,
      "▁سمعت": 2332,
      "▁آية": 2333,
      "َّي": 2334,
      "عون": 2335,
      "▁أراد": 2336,
      "ري،": 2337,
      "▁ضعيف": 2338,
      "▁فج": 2339,
      "▁\nوَال": 2340,
      "▁خرج": 2341,
      "▁فَال": 2342,
      "▁الدار": 2343,
      "▁فكان": 2344,
      "٥.": 2345,
      "▁لَهَا": 2346,
      "ين:": 2347,
      "▁يوسف": 2348,
      "▁يعلم": 2349,
      "ضًا": 2350,
      "حاديث": 2351,
      "▁رَو": 2352,
      "▁إِذا": 2353,
      "َفِي": 2354,
      "▁بعضهم": 2355,
      "ّي": 2356,
      "حل": 2357,
      "▁دع": 2358,
      "▁لنا": 2359,
      "▁المراد": 2360,
      "ضة": 2361,
      "▁ـ": 2362,
      "▁محم": 2363,
      "▁قلت": 2364,
      "٤.": 2365,
      "▁هل": 2366,
      "شام": 2367,
      "▁فمن": 2368,
      "٦.": 2369,
      "كذا": 2370,
      "وَاي": 2371,
      "▁الجز": 2372,
      "ى:": 2373,
      "ِيرُ": 2374,
      "▁\nر": 2375,
      "▁[٥]": 2376,
      "َيْت": 2377,
      "ْرِي": 2378,
      "ْهِ": 2379,
      "▁شيخ": 2380,
      "▁الصَّل": 2381,
      "ُنْ": 2382,
      "مَن": 2383,
      "▁العزيز": 2384,
      "▁فَهُوَ": 2385,
      "▁يَكُونَ": 2386,
      "▁بِع": 2387,
      "▁ولي": 2388,
      "امل": 2389,
      "٧.": 2390,
      "٨.": 2391,
      "٩]": 2392,
      "▁با": 2393,
      "▁الترمذي": 2394,
      "بلغ": 2395,
      "ِمَ": 2396,
      "▁إنْ": 2397,
      "لّى": 2398,
      "٩.": 2399,
      "َيْنَ": 2400,
      "ُؤ": 2401,
      "سه": 2402,
      "▁بالن": 2403,
      "▁الرُّ": 2404,
      "▁الساب": 2405,
      "▁ام": 2406,
      "▁وَهَذَا": 2407,
      "▁الجنة": 2408,
      "َابِل": 2409,
      "▁جعل": 2410,
      "يح": 2411,
      "▁المق": 2412,
      "واز": 2413,
      "▁عط": 2414,
      "▁العربي": 2415,
      "▁٣١": 2416,
      "▁سَل": 2417,
      "َئ": 2418,
      "▁عنها": 2419,
      "٠.": 2420,
      "تمل": 2421,
      "▁فَإِنَّهُ": 2422,
      "▁(٧": 2423,
      "▁إِبْرَاه": 2424,
      "ُقَهَا": 2425,
      "▁{ف": 2426,
      "شرك": 2427,
      "ِّهِ": 2428,
      "▁المخ": 2429,
      "▁خلاف": 2430,
      "َى،": 2431,
      "ائع": 2432,
      "باح": 2433,
      "▁عَبَّاس": 2434,
      "ولا": 2435,
      "▁تَر": 2436,
      "▁أنهم": 2437,
      "علق": 2438,
      "َدُّ": 2439,
      "ِى": 2440,
      "حْو": 2441,
      "▁\n٧": 2442,
      "▁غيره": 2443,
      "▁مَك": 2444,
      "▁وفيه": 2445,
      "▁٣٣": 2446,
      "رجع": 2447,
      "قَ": 2448,
      "▁شاء": 2449,
      "فعول": 2450,
      "ت:": 2451,
      "يمة": 2452,
      "▁قلت:": 2453,
      "ِعُ": 2454,
      "▁صلّى": 2455,
      "▁اخْت": 2456,
      "َرْضِ": 2457,
      "أم": 2458,
