{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|begin_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|eot_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|start_header_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|end_header_id|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "system",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "user",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "assistant",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|begin_of_text|>": 0,
      "<|eot_id|>": 1,
      "<|start_header_id|>": 2,
      "<|end_header_id|>": 3,
      "system": 4,
      "user": 5,
      "assistant": 6,
      "<unk>": 7,
      "<pad>": 8,
      "<mask>": 9,
      "\u0001": 10,
      "\u0002": 11,
      "\u0007": 12,
      "\t": 13,
      "\r": 14,
      "\u0010": 15,
      "\u001e": 16,
      "!": 17,
      "\"": 18,
      "#": 19,
      "$": 20,
      "%": 21,
      "&": 22,
      "'": 23,
      "(": 24,
      ")": 25,
      "*": 26,
      "+": 27,
      ",": 28,
      "-": 29,
      ".": 30,
      "/": 31,
      "0": 32,
      "1": 33,
      "2": 34,
      "3": 35,
      "4": 36,
      "5": 37,
      "6": 38,
      "7": 39,
      "8": 40,
      "9": 41,
      ":": 42,
      ";": 43,
      "<": 44,
      "=": 45,
      ">": 46,
      "?": 47,
      "@": 48,
      "A": 49,
      "B": 50,
      "C": 51,
      "D": 52,
      "E": 53,
      "F": 54,
      "G": 55,
      "H": 56,
      "I": 57,
      "J": 58,
      "K": 59,
      "L": 60,
      "M": 61,
      "N": 62,
      "O": 63,
      "P": 64,
      "Q": 65,
      "R": 66,
      "S": 67,
      "T": 68,
      "U": 69,
      "V": 70,
      "W": 71,
      "X": 72,
      "Y": 73,
      "Z": 74,
      "[": 75,
      "\\": 76,
      "]": 77,
      "^": 78,
      "_": 79,
      "`": 80,
      "a": 81,
      "b": 82,
      "c": 83,
      "d": 84,
      "e": 85,
      "f": 86,
      "g": 87,
      "h": 88,
      "i": 89,
      "j": 90,
      "k": 91,
      "l": 92,
      "m": 93,
      "n": 94,
      "o": 95,
      "p": 96,
      "q": 97,
      "r": 98,
      "s": 99,
      "t": 100,
      "u": 101,
      "v": 102,
      "w": 103,
      "x": 104,
      "y": 105,
      "z": 106,
      "{": 107,
      "}": 108,
      "~": 109,
      "¢": 110,
      "£": 111,
      "¤": 112,
      "¥": 113,
      "¦": 114,
      "§": 115,
      "©": 116,
      "«": 117,
      "­": 118,
      "®": 119,
      "°": 120,
      "±": 121,
      "¶": 122,
      "·": 123,
      "»": 124,
      "×": 125,
      "÷": 126,
      "Œ": 127,
      "œ": 128,
      "ˆ": 129,
      "́": 130,
      "̄": 131,
      "̈": 132,
      "̧": 133,
      "μ": 134,
      "،": 135,
      "؍": 136,
      "؎": 137,
      "ؑ": 138,
      "ؓ": 139,
      "؛": 140,
      "؟": 141,
      "ء": 142,
      "آ": 143,
      "أ": 144,
      "ؤ": 145,
      "إ": 146,
      "ئ": 147,
      "ا": 148,
      "ب": 149,
      "ة": 150,
      "ت": 151,
      "ث": 152,
      "ج": 153,
      "ح": 154,
      "خ": 155,
      "د": 156,
      "ذ": 157,
      "ر": 158,
      "ز": 159,
      "س": 160,
      "ش": 161,
      "ص": 162,
      "ض": 163,
      "ط": 164,
      "ظ": 165,
      "ع": 166,
      "غ": 167,
      "ـ": 168,
      "ف": 169,
      "ق": 170,
      "ك": 171,
      "ل": 172,
      "م": 173,
      "ن": 174,
      "ه": 175,
      "و": 176,
      "ى": 177,
      "ي": 178,
      "ً": 179,
      "ٌ": 180,
      "ٍ": 181,
      "َ": 182,
      "ُ": 183,
      "ِ": 184,
      "ّ": 185,
      "ْ": 186,
      "٠": 187,
      "١": 188,
      "٢": 189,
      "٣": 190,
      "٤": 191,
      "٥": 192,
      "٦": 193,
      "٧": 194,
      "٨": 195,
      "٩": 196,
      "ٰ": 197,
      "ٹ": 198,
      "پ": 199,
      "چ": 200,
      "ڈ": 201,
      "ڑ": 202,
      "ژ": 203,
      "ک": 204,
      "گ": 205,
      "ں": 206,
      "ھ": 207,
      "ہ": 208,
      "ۂ": 209,
      "ۃ": 210,
      "ی": 211,
      "ے": 212,
      "۔": 213,
      "۱": 214,
      "۲": 215,
      "۳": 216,
      "۴": 217,
      "​": 218,
      "‌": 219,
      "‍": 220,
      "‏": 221,
      "–": 222,
      "—": 223,
      "‘": 224,
      "’": 225,
      "‚": 226,
      "“": 227,
      "”": 228,
      "„": 229,
      "†": 230,
      "‡": 231,
      "•": 232,
      "‫": 233,
      "‰": 234,
      "‹": 235,
      "›": 236,
      "⁄": 237,
      "€": 238,
      "←": 239,
      "∞": 240,
      "∣": 241,
      "∴": 242,
      "≥": 243,
      "⊂": 244,
      "⌖": 245,
      "▁": 246,
      "□": 247,
      "⟨": 248,
      "⦗": 249,
      "⦘": 250,
      "⮙": 251,
      "﷜": 252,
      "﷤": 253,
      "ال": 254,
      "▁ال": 255,
      "▁و": 256,
      "▁م": 257,
      "▁أ": 258,
      "▁ف": 259,
      "▁ب": 260,
      "▁ع": 261,
      "َا": 262,
      "َّ": 263,
      "▁ل": 264,
      "▁ي": 265,
      "ِي": 266,
      "▁ق": 267,
      "َل": 268,
      "▁إ": 269,
      "▁وَ": 270,
      "ان": 271,
      "▁في": 272,
      "▁ت": 273,
      "▁الْ": 274,
      "َن": 275,
      "له": 276,
      "▁ك": 277,
      "▁(": 278,
      "هُ": 279,
      "▁من": 280,
      "▁ح": 281,
      "لا": 282,
      "اب": 283,
      "ما": 284,
      "لى": 285,
      "َي": 286,
      "▁الم": 287,
      "ُو": 288,
      "ين": 289,
      "▁ر": 290,
      "ها": 291,
      "هِ": 292,
      "لي": 293,
      "نَ": 294,
      "▁وال": 295,
      "▁س": 296,
      "َة": 297,
      "َيْ": 298,
      "▁.": 299,
      "▁بن": 300,
      "َر": 301,
      "َم": 302,
      "نا": 303,
      "▁ه": 304,
      "ِن": 305,
      "▁الله": 306,
      "وا": 307,
      "▁ص": 308,
      "▁عن": 309,
      "َال": 310,
      "َب": 311,
      "َو": 312,
      "▁-": 313,
      "ير": 314,
      "ار": 315,
      "▁أن": 316,
      "هم": 317,
      "َد": 318,
      "َع": 319,
      "لم": 320,
      "بي": 321,
      "▁ج": 322,
      "▁الأ": 323,
      "ِّ": 324,
      "ذا": 325,
      "ْت": 326,
      "▁،": 327,
      "ون": 328,
      "َى": 329,
      "▁على": 330,
      "ول": 331,
      "َنْ": 332,
      "▁بِ": 333,
      "ية": 334,
      "▁ش": 335,
      "▁ن": 336,
      "▁فِي": 337,
      "ْن": 338,
      "را": 339,
      "ْر": 340,
      "▁قال": 341,
      "ْل": 342,
      "ًا": 343,
      "▁ذ": 344,
      "▁١": 345,
      "▁ا": 346,
      "لَّ": 347,
      "َق": 348,
      "▁علي": 349,
      "ِنْ": 350,
      "▁الن": 351,
      "▁الح": 352,
      "ُّ": 353,
      "▁\"": 354,
      "▁عَل": 355,
      "▁ث": 356,
      "ْم": 357,
      "لك": 358,
      "▁الت": 359,
      "َت": 360,
      "▁خ": 361,
      "ــ": 362,
      "▁وق": 363,
      "▁[": 364,
      "ري": 365,
      "▁الع": 366,
      "دي": 367,
      "ِل": 368,
      "▁لا": 369,
      "▁اب": 370,
      "▁وأ": 371,
      "هَا": 372,
      "▁ما": 373,
      "▁الس": 374,
      "▁د": 375,
      "حم": 376,
      "َك": 377,
      "ام": 378,
      "اء": 379,
      "▁بال": 380,
      "▁الْم": 381,
      "َهُ": 382,
      "▁الق": 383,
      "مْ": 384,
      "▁اللَّ": 385,
      "▁الر": 386,
      "ات": 387,
      "▁عليه": 388,
      "َس": 389,
      "▁٢": 390,
      "▁الش": 391,
      "َالَ": 392,
      "مر": 393,
      "ِهِ": 394,
      "▁:": 395,
      "ست": 396,
      "من": 397,
      "ور": 398,
      "كر": 399,
      "▁غ": 400,
      "َح": 401,
      "بد": 402,
      "▁{": 403,
      "سلم": 404,
      "▁ابن": 405,
      "▁وه": 406,
      "ته": 407,
      "▁الص": 408,
      "اد": 409,
      "▁مِنْ": 410,
      "في": 411,
      "▁إلى": 412,
      "إن": 413,
      "ائ": 414,
      "ة،": 415,
      "َةِ": 416,
      "ْد": 417,
      "▁أو": 418,
      "أن": 419,
      "▁ط": 420,
      "َوْ": 421,
      "َلَّ": 422,
      "خر": 423,
      "▁وَال": 424,
      "بو": 425,
      "▁بْن": 426,
      "َذ": 427,
      "▁مُ": 428,
      "ِك": 429,
      "مع": 430,
      "▁كان": 431,
      "عد": 432,
      "▁الب": 433,
      "▁(١": 434,
      "ه،": 435,
      "▁الد": 436,
      "يد": 437,
      "▁مع": 438,
      "َج": 439,
      "َنَّ": 440,
      "مَا": 441,
      "َف": 442,
      "ُل": 443,
      "َّا": 444,
      "حمد": 445,
      "ْب": 446,
      "▁٣": 447,
      "يل": 448,
      "▁يُ": 449,
      "ني": 450,
      "▁أي": 451,
      "▁الج": 452,
      "َيْهِ": 453,
      "▁الك": 454,
      "▁عَنْ": 455,
      "وله": 456,
      "▁قَالَ": 457,
      "اً": 458,
      "▁الإ": 459,
      "َأ": 460,
      "▁«": 461,
      "حد": 462,
      "يم": 463,
      "وم": 464,
      "كم": 465,
      "▁ز": 466,
      "قد": 467,
      "▁عبد": 468,
      "▁إِ": 469,
      "ُهُ": 470,
      "▁أبي": 471,
      "بر": 472,
      "▁وَل": 473,
      "ــــ": 474,
      "ُم": 475,
      "َّة": 476,
      "ود": 477,
      "▁إن": 478,
      "▁الف": 479,
      "َاء": 480,
      "▁لل": 481,
      "▁الذ": 482,
      "ِر": 483,
      "قال": 484,
      "ِم": 485,
      "ِ،": 486,
      "▁عَلَى": 487,
      "َاب": 488,
      "▁ذلك": 489,
      "▁عَلَيْهِ": 490,
      "اف": 491,
      "▁آ": 492,
      "َانَ": 493,
      "لام": 494,
      "▁هذا": 495,
      "▁تع": 496,
      "ديث": 497,
      "ُر": 498,
      "َار": 499,
      "با": 500,
      "▁أَب": 501,
      "▁قال:": 502,
      "ْع": 503,
      "▁به": 504,
      "عل": 505,
      "▁وك": 506,
      "▁لم": 507,
      "رب": 508,
      "▁الخ": 509,
      "َص": 510,
      "َان": 511,
      "َه": 512,
      "ُوا": 513,
      "▁(٢": 514,
      "▁له": 515,
      "ُول": 516,
      "▁٤": 517,
      "▁وسلم": 518,
      "ِع": 519,
      "ِب": 520,
      "▁وي": 521,
      "▁وع": 522,
      "▁أبو": 523,
      "▁ولا": 524,
      "شر": 525,
      "▁..": 526,
      "حي": 527,
      "▁وت": 528,
      "لف": 529,
      "عة": 530,
      "َام": 531,
      "▁الْح": 532,
      "اه": 533,
      "▁/": 534,
      "جه": 535,
      "َةَ": 536,
      "▁صلى": 537,
      "ذه": 538,
      "رف": 539,
      "لة": 540,
      "وَ": 541,
      "َمْ": 542,
      "َخ": 543,
      "▁ثم": 544,
      "ُونَ": 545,
      "قي": 546,
      "سن": 547,
      "▁وهو": 548,
      "▁الث": 549,
      "▁وا": 550,
      "▁مَا": 551,
      "▁الْمُ": 552,
      "كون": 553,
      "▁الط": 554,
      "▁لِ": 555,
      "▁...": 556,
      "ِنَّ": 557,
      "▁(١)": 558,
      "ِد": 559,
      "فر": 560,
      "اني": 561,
      "▁هو": 562,
      "مَ": 563,
      "▁وَق": 564,
      "الى": 565,
      "ِينَ": 566,
      "▁وقال": 567,
      "َةُ": 568,
      "يب": 569,
      "فس": 570,
      "▁ان": 571,
      "▁أَنَّ": 572,
      "َنَا": 573,
      "▁نَ": 574,
      "▁يق": 575,
      "سم": 576,
      "▁وم": 577,
      "لت": 578,
      "▁الز": 579,
      "▁اللَّهُ": 580,
      "رو": 581,
      "َرْ": 582,
      "▁لأن": 583,
      "ِكَ": 584,
      "▁يع": 585,
      "▁بِال": 586,
      "َض": 587,
      "▁محمد": 588,
      "▁ول": 589,
      "جل": 590,
      "اق": 591,
      "▁الْع": 592,
      "▁تعالى": 593,
      "صل": 594,
      "ٍ،": 595,
      "▁إِل": 596,
      "▁قوله": 597,
      "رة": 598,
      "َدَّ": 599,
      "َوْل": 600,
      "َاد": 601,
      "▁٥": 602,
      "▁وَس": 603,
      "▁وَأ": 604,
      "ُمْ": 605,
      "ْف": 606,
      "ضي": 607,
      "▁بع": 608,
      "▁الآ": 609,
      "وب": 610,
      "ْح": 611,
      "▁إذا": 612,
      "▁فيه": 613,
      "رج": 614,
      "▁اللَّهِ": 615,
      "نة": 616,
      "▁(٣": 617,
      "▁فإن": 618,
      "▁الو": 619,
      "سول": 620,
      "نى": 621,
      "▁مِ": 622,
      "▁الْأ": 623,
      "اع": 624,
      "▁بْنُ": 625,
      "▁أَنْ": 626,
      "تاب": 627,
      "بل": 628,
      "▁غير": 629,
      "▁وفي": 630,
      "▁قَالَ:": 631,
      "▁قد": 632,
      "َيْر": 633,
      "▁لي": 634,
      "▁ض": 635,
      "َط": 636,
      "َذَا": 637,
      "▁فقال": 638,
      "إِ": 639,
      "▁بعد": 640,
      "▁أَوْ": 641,
      "هما": 642,
      "ْي": 643,
      "َش": 644,
      "▁الْق": 645,
      "مة": 646,
      "▁(٢)": 647,
      "لق": 648,
      "▁كَانَ": 649,
      "▁أنه": 650,
      "▁إلا": 651,
      "▁لَا": 652,
      "▁بين": 653,
      "ْو": 654,
      "▁عمر": 655,
      "َلَّى": 656,
      "َلِكَ": 657,
      "رك": 658,
      "هُوَ": 659,
      "خت": 660,
      "ْق": 661,
      "ذلك": 662,
      "تب": 663,
      "وي": 664,
      "▁النَّ": 665,
      "ْس": 666,
      "صر": 667,
      "▁لَهُ": 668,
      "وس": 669,
      "▁وب": 670,
      "ه.": 671,
      "▁وج": 672,
      "▁والم": 673,
      "ِيل": 674,
      "▁حد": 675,
      "َات": 676,
      "نِ": 677,
      "▁وقد": 678,
      "رض": 679,
      "▁}": 680,
      "اري": 681,
      "▁عَن": 682,
      "سب": 683,
      "▁كما": 684,
      "▁الذي": 685,
      "اج": 686,
      "كن": 687,
      "فع": 688,
      "مي": 689,
      "▁بْنِ": 690,
      "لب": 691,
      "ُن": 692,
      "ْك": 693,
      "تى": 694,
      "▁صَلَّى": 695,
      "هل": 696,
      "ِير": 697,
      "▁رسول": 698,
      "ظر": 699,
      "ــــــــ": 700,
      "قة": 701,
      "عم": 702,
      "ِيُّ": 703,
      "هر": 704,
      "اح": 705,
      "َتْ": 706,
      "ذَا": 707,
      "▁وَسَلَّ": 708,
      "▁عَب": 709,
      "تح": 710,
      "▁وإن": 711,
      "▁\"ال": 712,
      "غير": 713,
      "▁فَق": 714,
      "دة": 715,
      "▁عند": 716,
      "َرَ": 717,
      "َائ": 718,
      "▁فأ": 719,
      "▁فَ": 720,
      "▁وَسَلَّمَ": 721,
      "َّل": 722,
      "▁ومن": 723,
      "▁٦": 724,
      "َّد": 725,
      "▁إلي": 726,
      "▁أخ": 727,
      "وف": 728,
      "▁النا": 729,
      "▁عنه": 730,
      "ابن": 731,
      "▁لأ": 732,
      "وج": 733,
      "سْت": 734,
      "▁كل": 735,
      "▁ذكر": 736,
      "َز": 737,
      "▁هذه": 738,
      "ِّي": 739,
      "▁المع": 740,
      "وع": 741,
      "▁إِلَى": 742,
      "▁أم": 743,
      "▁وإ": 744,
      "تم": 745,
      "▁وس": 746,
      "ة.": 747,
      "ْرِ": 748,
      "عي": 749,
      "▁فَل": 750,
      "ِيَّة": 751,
      "▁الا": 752,
      "▁الَّ": 753,
      "▁مِنَ": 754,
      "ِيَ": 755,
      "ها،": 756,
      "▁حديث": 757,
      "ثنا": 758,
      "وق": 759,
      "٤)": 760,
      "َّر": 761,
      "َدَّث": 762,
      "جر": 763,
      "ُب": 764,
      "ُك": 765,
      "صح": 766,
      "َهَا": 767,
      "َدْ": 768,
      "▁[١": 769,
      "▁*": 770,
      "َاف": 771,
      "َعْ": 772,
      "مان": 773,
      "وى": 774,
      "▁شي": 775,
      "▁ظ": 776,
      "▁أَبِي": 777,
      "َاع": 778,
      "▁ابْن": 779,
      "▁يكون": 780,
      "▁يج": 781,
      "راء": 782,
      "تي": 783,
      "▁ين": 784,
      "ده": 785,
      "▁بِهِ": 786,
      "مُ": 787,
      "▁يت": 788,
      "▁وَي": 789,
      "▁ور": 790,
      "▁بعض": 791,
      "▁حَدَّث": 792,
      "▁(٣)": 793,
      "▁أَح": 794,
      "َاح": 795,
      "▁الْب": 796,
      "لّ": 797,
      "ماء": 798,
      "َسُول": 799,
      "فة": 800,
      "يا": 801,
      "ِيد": 802,
      "▁أع": 803,
      "ُ:": 804,
      "▁ون": 805,
      "▁عَبْد": 806,
      "ورة": 807,
      "▁أحمد": 808,
      "بت": 809,
      "▁اللَّه": 810,
      "▁٧": 811,
      "▁لِل": 812,
      "ضع": 813,
      "ِيِّ": 814,
      "▁است": 815,
      "▁الغ": 816,
      "ذكر": 817,
      "إِنْ": 818,
      "حيح": 819,
      "َ،": 820,
      "ُق": 821,
      "▁وكان": 822,
      "▁حتى": 823,
      "َةٌ": 824,
      "ُ،": 825,
      "▁أخر": 826,
      "حا": 827,
      "▁ذَلِكَ": 828,
      "خل": 829,
      "َةً": 830,
      "▁أحد": 831,
      "َث": 832,
      "▁التي": 833,
      "▁الْج": 834,
      "وز": 835,
      "▁رَسُول": 836,
      "▁التَّ": 837,
      "هد": 838,
      "▁وما": 839,
      "▁مُح": 840,
      "رق": 841,
      "▁)": 842,
      "ِق": 843,
      "▁الرَّ": 844,
      "به": 845,
      "مس": 846,
      "▁أَبُو": 847,
      "ُمَّ": 848,
      "يت": 849,
      "هُمْ": 850,
      "▁الْو": 851,
      "ّا": 852,
      "َاق": 853,
      "▁مَع": 854,
      "مل": 855,
      "▁بل": 856,
      "▁الحديث": 857,
      "قول": 858,
      "در": 859,
      "▁النبي": 860,
      "ين،": 861,
      "ًا،": 862,
      "▁الْف": 863,
      "سان": 864,
      "▁الَّذ": 865,
      "ُد": 866,
      "ْج": 867,
      "▁لَمْ": 868,
      "▁روا": 869,
      "وه": 870,
      "ُس": 871,
      "▁إس": 872,
      "حت": 873,
      "٥)": 874,
      "▁فى": 875,
      "▁القر": 876,
      "▁أَن": 877,
      "▁وَك": 878,
      "إِنَّ": 879,
      "وت": 880,
      "ْتُ": 881,
      "ْط": 882,
      "▁والت": 883,
      "▁نا": 884,
      "▁وَع": 885,
      "ثر": 886,
      "▁سب": 887,
      "قت": 888,
      "ِهَا": 889,
      "ِف": 890,
      "▁مَنْ": 891,
      "رأ": 892,
      "رم": 893,
      "َوْم": 894,
      "بة": 895,
      "▁تَع": 896,
      "▁٨": 897,
      "َمَّد": 898,
      "مام": 899,
      "راد": 900,
      "▁مث": 901,
      "▁فه": 902,
      "▁حَدَّثَنَا": 903,
      "▁الْك": 904,
      "▁كتاب": 905,
      "▁وح": 906,
      "▁أهل": 907,
      "أَنَّ": 908,
      "▁مت": 909,
      "ليل": 910,
      "▁سنة": 911,
      "الك": 912,
      "ثير": 913,
      "سر": 914,
      "قط": 915,
      "▁هَذَا": 916,
      "▁فل": 917,
      "قل": 918,
      "اص": 919,
      "َغ": 920,
      "لاث": 921,
      "ريق": 922,
      "▁وَم": 923,
      "▁يقول": 924,
      "ِح": 925,
      "▁فِيهِ": 926,
      "َةٍ": 927,
      "َدِي": 928,
      "َمَا": 929,
      "▁والأ": 930,
      "▁مس": 931,
      "▁منه": 932,
      "لَّا": 933,
      "َيْنِ": 934,
      "وال": 935,
      "▁ولم": 936,
      "▁أَيْ": 937,
      "▁المن": 938,
      "▁مُحَمَّد": 939,
      "ْص": 940,
      "▁وَهُوَ": 941,
      "لها": 942,
      "عت": 943,
      "شي": 944,
      "ِس": 945,
      "٢]": 946,
      "ِيم": 947,
      "▁الْخ": 948,
      "▁ثُمَّ": 949,
      "َاءِ": 950,
      "▁[١]": 951,
      "▁مح": 952,
      "از": 953,
      "بير": 954,
      "ِت": 955,
      "▁يد": 956,
      "▁يَق": 957,
      "سي": 958,
      "قر": 959,
      "الم": 960,
      "▁أَخ": 961,
      "كان": 962,
      "ْه": 963,
      "▁بها": 964,
      "ِنْد": 965,
      "▁وأن": 966,
      "آن": 967,
      "▁فيها": 968,
      "َّى": 969,
      "▁بَيْ": 970,
      "▁وابن": 971,
      "▁فلا": 972,
      "ُف": 973,
      "ْنَ": 974,
      "▁الناس": 975,
      "َمَّا": 976,
      "هم،": 977,
      "▁وَلَا": 978,
      "ُون": 979,
      "▁الل": 980,
      "ه:": 981,
      "▁حدثنا": 982,
      "لاة": 983,
      "ُج": 984,
      "▁بأ": 985,
      "▁٩": 986,
      "ُور": 987,
      "٦)": 988,
      "ُع": 989,
      "▁قَال": 990,
      "َعْد": 991,
      "دين": 992,
      "ادة": 993,
      "▁يا": 994,
      "راه": 995,
      "َّاس": 996,
      "▁الض": 997,
      "َاهُ": 998,
      "كل": 999,
      "ِ.": 1000,
      "رد": 1001,
      "▁يح": 1002,
      "▁بد": 1003,
      "▁عَنِ": 1004,
      "فا": 1005,
      "جم": 1006,
      "▁يوم": 1007,
      "ٌ،": 1008,
      "▁الي": 1009,
      "ْخ": 1010,
      "▁الشي": 1011,
      "▁السَّ": 1012,
      "▁باب": 1013,
      "▁[ال": 1014,
      "ذي": 1015,
      "رح": 1016,
      "▁أَنَّهُ": 1017,
      "اط": 1018,
      "قدم": 1019,
      "▁{و": 1020,
      "سل": 1021,
      "صف": 1022,
      "سلام": 1023,
      "▁فَأ": 1024,
      "لاف": 1025,
      "▁عِنْد": 1026,
      "▁قَوْل": 1027,
      "▁هُوَ": 1028,
      "▁يَك": 1029,
      "كَ": 1030,
      "▁قوله:": 1031,
      "▁(ال": 1032,
      "▁وَف": 1033,
      "▁١٠": 1034,
      "▁(٤)": 1035,
      "قم": 1036,
      "باس": 1037,
      "▁الآية": 1038,
      "َلَ": 1039,
      "زل": 1040,
      "▁قول": 1041,
      "▁الصَّ": 1042,
      "▁لما": 1043,
      "▁إل": 1044,
      "لاً": 1045,
      "▁واحد": 1046,
      "زم": 1047,
      "▁والن": 1048,
      "خرج": 1049,
      "بار": 1050,
      "▁المؤ": 1051,
      "▁وهذا": 1052,
      "عيد": 1053,
      "فق": 1054,
      "▁الظ": 1055,
      "ماع": 1056,
      "٧)": 1057,
      "جد": 1058,
      "▁غَيْر": 1059,
      "▁المس": 1060,
      "زي": 1061,
      "بع": 1062,
      "▁رضي": 1063,
      "▁رأ": 1064,
      "َدِيث": 1065,
      "▁بم": 1066,
      "َاج": 1067,
      "▁وَج": 1068,
      "٣]": 1069,
      "▁ليس": 1070,
      "▁مو": 1071,
      "▁(و": 1072,
      "▁الشَّ": 1073,
      "ية،": 1074,
      "يس": 1075,
      "▁فَقَالَ": 1076,
      "▁إِنَّ": 1077,
      "▁الوا": 1078,
      "▁قبل": 1079,
      "▁المت": 1080,
      "واب": 1081,
      "حة": 1082,
      "شت": 1083,
      "▁أح": 1084,
      "فت": 1085,
      "دا": 1086,
      "▁بي": 1087,
      "ضل": 1088,
      "▁١١": 1089,
      "َانِ": 1090,
      "َاة": 1091,
      "▁ثنا": 1092,
      "َنِي": 1093,
      "▁لو": 1094,
      "▁فقال:": 1095,
      "▁أخرجه": 1096,
      "▁تح": 1097,
      "▁لاَ": 1098,
      "▁أيض": 1099,
      "▁إليه": 1100,
      "▁,": 1101,
      "▁النَّب": 1102,
      "▁أمر": 1103,
      "▁كثير": 1104,
      "الة": 1105,
      "▁البي": 1106,
      "يف": 1107,
      "رير": 1108,
      "▁أس": 1109,
      "يات": 1110,
      "وان": 1111,
      "خذ": 1112,
      "▁بكر": 1113,
      "حو": 1114,
      "▁وقيل": 1115,
      "▁مسلم": 1116,
      "▁آخر": 1117,
      "▁نفس": 1118,
      "▁[٢]": 1119,
      "ْلِ": 1120,
      "▁وغير": 1121,
      "٨)": 1122,
      "ْأ": 1123,
      "▁وَه": 1124,
      "▁١٢": 1125,
      "▁تعالى:": 1126,
      "يث": 1127,
      "▁بأن": 1128,
      "َلْ": 1129,
      "َيْس": 1130,
      "نَّ": 1131,
      "تَّ": 1132,
      "▁فَي": 1133,
      "▁فت": 1134,
      "▁قلت": 1135,
      "▁رج": 1136,
      "▁القرآن": 1137,
      "لاء": 1138,
      "قوله": 1139,
      "خاري": 1140,
      "▁وَت": 1141,
      "▁١٣": 1142,
      "ِيع": 1143,
      "َالَى": 1144,
      "ُود": 1145,
      "َاس": 1146,
      "▁فال": 1147,
      "▁١٩": 1148,
      "▁لِأَنَّ": 1149,
      "▁إِذَا": 1150,
      "ة:": 1151,
      "▁لأنه": 1152,
      "ــــــــــــــــ": 1153,
      "▁دا": 1154,
      "▁رقم": 1155,
      "رى": 1156,
      "َيْن": 1157,
      "▁يس": 1158,
      "َتَّى": 1159,
      "▁وف": 1160,
      "▁إب": 1161,
      "▁وهي": 1162,
      "َرَّ": 1163,
      "▁عَنْهُ": 1164,
      "صد": 1165,
      "▁مِنْهُ": 1166,
      "َرِي": 1167,
      "▁أب": 1168,
      "عا": 1169,
      "▁وَر": 1170,
      "▁أي:": 1171,
      "َرُ": 1172,
      "ارة": 1173,
      "اَ": 1174,
      "▁كانت": 1175,
      "▁اللهُ": 1176,
      "▁بَعْد": 1177,
      "صب": 1178,
      "ان،": 1179,
      "ِث": 1180,
      "▁لهم": 1181,
      "ْنَا": 1182,
      "▁الرحم": 1183,
      "▁شَيْ": 1184,
      "▁يَع": 1185,
      "اهر": 1186,
      "تها": 1187,
      "٩)": 1188,
      "٠)": 1189,
      "ضِ": 1190,
      "▁الَّذِي": 1191,
      "▁وَب": 1192,
      "▁تَعَالَى": 1193,
      "▁قَب": 1194,
      "▁الحسن": 1195,
      "ند": 1196,
      "▁صحيح": 1197,
      "▁أَو": 1198,
      "وة": 1199,
      "▁وَقَالَ": 1200,
      "▁وخ": 1201,
      "قات": 1202,
      "١)": 1203,
      "ُوب": 1204,
      "▁طريق": 1205,
      "▁بما": 1206,
      "▁حَتَّى": 1207,
      "▁اله": 1208,
      "▁١٤": 1209,
      "َبَ": 1210,
      "راهيم": 1211,
      "طي": 1212,
      "كُمْ": 1213,
      "▁سعيد": 1214,
      "عر": 1215,
      "▁كَمَا": 1216,
      "▁جاء": 1217,
      "حق": 1218,
      "َاي": 1219,
      "▁المص": 1220,
      "▁للم": 1221,
      "▁عد": 1222,
      "تُ": 1223,
      "▁هي": 1224,
      "ليس": 1225,
      "ِهِمْ": 1226,
      "▁القا": 1227,
      "▁بَيْنَ": 1228,
      "▁عَبْدِ": 1229,
      "▁انظر": 1230,
      "َنِ": 1231,
      "ٍّ": 1232,
      "▁وَفِي": 1233,
      "▁سمع": 1234,
      "إذا": 1235,
      "▁البخاري": 1236,
      "َيِّ": 1237,
      "اس": 1238,
      "▁شيء": 1239,
      "عب": 1240,
      "▁١/": 1241,
      "حر": 1242,
      "▁قت": 1243,
      "▁مج": 1244,
      "٢)": 1245,
      "َيَّ": 1246,
      "▁يست": 1247,
      "وح": 1248,
      "▁مثل": 1249,
      "ِين": 1250,
      "ضر": 1251,
      "َاءَ": 1252,
      "َعَ": 1253,
      "▁يَح": 1254,
      "▁الدين": 1255,
      "▁الأَ": 1256,
      "▁إذ": 1257,
      "▁مالك": 1258,
      "▁هـ": 1259,
      "▁منها": 1260,
      "خْت": 1261,
      "▁فهو": 1262,
      "ُهَا": 1263,
      "▁يَج": 1264,
      "٤]": 1265,
      "معنى": 1266,
      "▁ثلاث": 1267,
      "ى،": 1268,
      "ِ:": 1269,
      "▁يم": 1270,
      "امة": 1271,
      "▁٢/": 1272,
      "▁أخبر": 1273,
      "▁الأول": 1274,
      "▁كُل": 1275,
      "▁يَت": 1276,
      "ْتَ": 1277,
      "▁الأم": 1278,
      "٣)": 1279,
      "▁مر": 1280,
      "▁الثَّ": 1281,
      "▁وَالْم": 1282,
      "ِهِ،": 1283,
      "قص": 1284,
      "ِيّ": 1285,
      "▁داود": 1286,
      "▁رَب": 1287,
      "فظ": 1288,
      "▁كال": 1289,
      "صحاب": 1290,
      "▁والع": 1291,
      "▁الأن": 1292,
      "ئة": 1293,
      "▁وَإِنْ": 1294,
      "▁الرحمن": 1295,
      "▁والح": 1296,
      "م،": 1297,
      "▁فق": 1298,
      "▁لها": 1299,
      "▁عَم": 1300,
      "▁؛": 1301,
      "جب": 1302,
      "ينا": 1303,
      "▁أك": 1304,
      "▁فَإِنَّ": 1305,
      "▁إِلَّا": 1306,
      "▁عباس": 1307,
      "▁سورة": 1308,
      "▁يأ": 1309,
      "َاو": 1310,
      "▁وص": 1311,
      "▁عشر": 1312,
      "▁الإسلام": 1313,
      "د،": 1314,
      "نت": 1315,
      "▁فقد": 1316,
      "ذهب": 1317,
      "فسير": 1318,
      "َهُمْ": 1319,
      "▁ولك": 1320,
      "ًّا": 1321,
      "▁أش": 1322,
      "▁عمرو": 1323,
      "َرِ": 1324,
      "▁أص": 1325,
      "وفي": 1326,
      "الح": 1327,
      "▁(٤": 1328,
      "ي،": 1329,
      "▁وأبو": 1330,
      "▁ابْنُ": 1331,
      "▁علم": 1332,
      "ٌّ": 1333,
      "▁مك": 1334,
      "رع": 1335,
      "ميع": 1336,
      "▁يز": 1337,
      "▁عُم": 1338,
      "▁الذين": 1339,
      "تق": 1340,
      "َمُ": 1341,
      "▁١٥": 1342,
      "▁روى": 1343,
      "تْ": 1344,
      "ائل": 1345,
      "▁[٣]": 1346,
      "ُص": 1347,
      "▁رواه": 1348,
      "▁مَال": 1349,
      "نه": 1350,
      "َابِ": 1351,
      "▁قب": 1352,
      "▁حم": 1353,
      "اة": 1354,
      "▁يحي": 1355,
      "اريخ": 1356,
      "▁أق": 1357,
      "َاز": 1358,
      "َيْد": 1359,
      "انه": 1360,
      "▁إبراهيم": 1361,
      "▁١٨": 1362,
      "راً": 1363,
      "▁وجه": 1364,
      "َّةِ": 1365,
      "فتح": 1366,
      "يّ": 1367,
      "ذر": 1368,
      "مه": 1369,
      "هب": 1370,
      "ُوس": 1371,
      "وض": 1372,
      "ُخ": 1373,
      "طر": 1374,
      "ْبَر": 1375,
      "َيْسَ": 1376,
      "▁وقوله": 1377,
      "▁هنا": 1378,
      "ولى": 1379,
      "▁رجل": 1380,
      "▁يَوْم": 1381,
      "ْمِ": 1382,
      "فْس": 1383,
      "▁النس": 1384,
      "▁١٦": 1385,
      "▁لَك": 1386,
      "▁يَس": 1387,
      "▁بك": 1388,
      "َةِ،": 1389,
      "ها.": 1390,
      "▁رب": 1391,
      "▁١٧": 1392,
      "ُه": 1393,
      "▁هُ": 1394,
      "▁بح": 1395,
      "▁زيد": 1396,
      "▁وأما": 1397,
      "▁(٥)": 1398,
      "ذب": 1399,
      "▁السلام": 1400,
      "▁تن": 1401,
      "ابة": 1402,
      "▁فع": 1403,
      "وات": 1404,
      "ين.": 1405,
      "َةَ،": 1406,
      "ِه": 1407,
      "▁(أ": 1408,
      "▁وان": 1409,
      "ِّر": 1410,
      "▁عِنْدَ": 1411,
      "▁يش": 1412,
      "▁العلم": 1413,
      "▁أَي": 1414,
      "وص": 1415,
      "▁أَه": 1416,
      "لال": 1417,
      "غة": 1418,
      "َدَ": 1419,
      "سْل": 1420,
      "َارِ": 1421,
      "َاهِ": 1422,
      "▁اسْت": 1423,
      "▁يقال": 1424,
      "▁الاست": 1425,
      "▁قيل": 1426,
      "ْث": 1427,
      "َِنَّ": 1428,
      "ْض": 1429,
      "ِيح": 1430,
      "▁مَعَ": 1431,
      "مت": 1432,
      "▁وث": 1433,
      "طل": 1434,
      "▁ولو": 1435,
      "ِص": 1436,
      "قه": 1437,
      "َلا": 1438,
      "َاتِ": 1439,
      "▁فا": 1440,
      "▁الصلاة": 1441,
      "▁تقدم": 1442,
      "▁اخت": 1443,
      "إِذَا": 1444,
      "▁أنا": 1445,
      "▁يَقُول": 1446,
      "٥]": 1447,
      "َاض": 1448,
      "▁فيما": 1449,
      "رط": 1450,
      "ا،": 1451,
      "الب": 1452,
      "صار": 1453,
      "ُح": 1454,
      "نف": 1455,
      "ماً": 1456,
      "▁يعني": 1457,
      "▁اللهِ": 1458,
      "▁تأ": 1459,
      "ِيب": 1460,
      "▁أَص": 1461,
      "▁أَم": 1462,
      "عين": 1463,
      "▁أج": 1464,
      "▁حال": 1465,
      "َظ": 1466,
      "اش": 1467,
      "▁اسم": 1468,
      "▁الشيخ": 1469,
      "قب": 1470,
      "▁فإذا": 1471,
      "لهم": 1472,
      "▁مص": 1473,
      "حاق": 1474,
      "َامِ": 1475,
      "▁منهم": 1476,
      "▁صاح": 1477,
      "ريب": 1478,
      "▁يك": 1479,
      "َاص": 1480,
      "▁الخط": 1481,
      "ته،": 1482,
      "▁أد": 1483,
      "غني": 1484,
      "▁•": 1485,
      "وك": 1486,
      "َعْض": 1487,
      "ْز": 1488,
      "ِبُ": 1489,
      "▁الدَّ": 1490,
      "▁الأرض": 1491,
      "ْهُ": 1492,
      "نَا": 1493,
      "▁موس": 1494,
      "رائ": 1495,
      "قَوْل": 1496,
      "ناه": 1497,
      "▁المسلم": 1498,
      "▁أَحْم": 1499,
      "▁قَبْل": 1500,
      "فِع": 1501,
      "▁الكتاب": 1502,
      "▁عم": 1503,
      "▁دون": 1504,
      "▁لك": 1505,
      "▁مما": 1506,
      "▁يحيى": 1507,
      "ريد": 1508,
      "وط": 1509,
      "ُهُمْ": 1510,
      "▁يخ": 1511,
      "▁وَح": 1512,
      "▁ها": 1513,
      "▁وَمَا": 1514,
      "ِيق": 1515,
      "ْرٍ": 1516,
      "▁عليهم": 1517,
      "تِ": 1518,
      "▁والله": 1519,
      "▁٢٠": 1520,
      "▁النَّاس": 1521,
      "▁سَم": 1522,
      "ِيَّةِ": 1523,
      "▁ترج": 1524,
      "انية": 1525,
      "َاه": 1526,
      "طلق": 1527,
      "ضم": 1528,
      "▁الإِ": 1529,
      "▁تق": 1530,
      "ذيب": 1531,
      "▁وش": 1532,
      "غَيْر": 1533,
      "▁عَلَيْ": 1534,
      "▁قل": 1535,
      "▁أَحَد": 1536,
      "▁رَج": 1537,
      "▁تَق": 1538,
      "▁قُل": 1539,
      "▁مست": 1540,
      "▁رحم": 1541,
      "▁ود": 1542,
      "َلَا": 1543,
      "▁سن": 1544,
      "▁الْإِ": 1545,
      "▁فِيهَا": 1546,
      "لفظ": 1547,
      "▁(ف": 1548,
      "الث": 1549,
      "▁الآخر": 1550,
      "▁يُق": 1551,
      "تِي": 1552,
      "▁رَض": 1553,
      "▁حسن": 1554,
      "▁والإ": 1555,
      "▁بِأ": 1556,
      "مال": 1557,
      "▁أما": 1558,
      "▁فعل": 1559,
      "▁عام": 1560,
      "▁بت": 1561,
      "▁المح": 1562,
      "▁الإن": 1563,
      "َّب": 1564,
      "▁بإ": 1565,
      "ِيلَ": 1566,
      "َاحِد": 1567,
      "▁الإمام": 1568,
      "▁إنما": 1569,
      "▁الحق": 1570,
      "اهد": 1571,
      "َرْب": 1572,
      "▁حق": 1573,
      "ربي": 1574,
      "▁الحج": 1575,
      "ظم": 1576,
      "رس": 1577,
      "ُوع": 1578,
      "َاط": 1579,
      "▁«ال": 1580,
      "شْت": 1581,
      "اء،": 1582,
      "تد": 1583,
      "▁فك": 1584,
      "لمة": 1585,
      "▁\"أ": 1586,
      "▁يجوز": 1587,
      "▁بَعْدَ": 1588,
      "نيا": 1589,
      "بيد": 1590,
      "▁يكن": 1591,
      "ضى": 1592,
      "▁الله،": 1593,
      "طع": 1594,
      "▁يَا": 1595,
      "▁وعن": 1596,
      "▁عز": 1597,
      "▁ابْنِ": 1598,
      "▁فلم": 1599,
      "ًا.": 1600,
      "▁لابن": 1601,
      "▁خال": 1602,
      "ّة": 1603,
      "ديد": 1604,
      "▁أف": 1605,
      "▁٢١": 1606,
      "▁جمع": 1607,
      "▁مِن": 1608,
      "خص": 1609,
      "يمان": 1610,
      "▁لأَِنَّ": 1611,
      "ْنِ": 1612,
      "ُونُ": 1613,
      "َمِ": 1614,
      "▁الْغ": 1615,
      "٢،": 1616,
      "▁بالم": 1617,
      "▁قلت:": 1618,
      "▁يَد": 1619,
      "صلى": 1620,
      "لاق": 1621,
      "▁الأصل": 1622,
      "▁وز": 1623,
      "ْذ": 1624,
      "▁(٥": 1625,
      "َمَ": 1626,
      "▁الَّذِينَ": 1627,
      "٣،": 1628,
      "▁الثاني": 1629,
      "▁]": 1630,
      "▁إِنْ": 1631,
      "▁رَسُولُ": 1632,
      "يه": 1633,
      "▁وَقَدْ": 1634,
      "▁الأمر": 1635,
      "َذِهِ": 1636,
      "▁أَخْبَر": 1637,
      "إِن": 1638,
      "▁إِس": 1639,
      "جز": 1640,
      "▁الرجل": 1641,
      "▁أبا": 1642,
      "▁إلَى": 1643,
      "لط": 1644,
      "▁فإنه": 1645,
      "▁جع": 1646,
      "٥،": 1647,
      "هـ": 1648,
      "ِيَّ": 1649,
      "▁بِم": 1650,
      "▁فَإِنْ": 1651,
      "٤،": 1652,
      "▁معنى": 1653,
      "اً،": 1654,
      "١،": 1655,
      "َكَ": 1656,
      "تهى": 1657,
      "».": 1658,
      "تَ": 1659,
      "٦،": 1660,
      "▁٢٢": 1661,
      "روف": 1662,
      "عه": 1663,
      "▁دار": 1664,
      "▁رواية": 1665,
      "طب": 1666,
      "ةِ": 1667,
      "٩،": 1668,
      "تين": 1669,
      "ائر": 1670,
      "▁عل": 1671,
      "▁الملك": 1672,
      "ِيَّةُ": 1673,
      "▁أَع": 1674,
      "▁ولكن": 1675,
      "٧،": 1676,
      "▁كلام": 1677,
      "ْرُ": 1678,
      "ْظ": 1679,
      "▁المؤمن": 1680,
      "▁يؤ": 1681,
      "َّافِع": 1682,
      "▁موسى": 1683,
      "▁وذلك": 1684,
      "▁حَدِيث": 1685,
      "▁سبح": 1686,
      "٠،": 1687,
      "٨،": 1688,
      "▁وإنما": 1689,
      "تهم": 1690,
      "▁دين": 1691,
      "ريم": 1692,
      "▁حب": 1693,
      "▁عليها": 1694,
      "▁حيث": 1695,
      "واء": 1696,
      "ْمُ": 1697,
      "ائي": 1698,
      "▁لَوْ": 1699,
      "ْتِ": 1700,
      "طف": 1701,
      "▁(١/": 1702,
      "َالِ": 1703,
      "▁٢٣": 1704,
      "▁سعد": 1705,
      "▁تس": 1706,
      "٦]": 1707,
      "َاءُ": 1708,
      "▁[٤]": 1709,
      "▁قَدْ": 1710,
      "افظ": 1711,
      "ك،": 1712,
      "▁سَب": 1713,
      "ذك": 1714,
      "ْلُ": 1715,
      "▁أصحاب": 1716,
      "وية": 1717,
      "قيق": 1718,
      "▁حين": 1719,
      "ُوف": 1720,
      "ره": 1721,
      "▁سلي": 1722,
      "نس": 1723,
      "َعَل": 1724,
      "▁القول": 1725,
      "▁الرَّح": 1726,
      "▁مش": 1727,
      "ثمان": 1728,
      "زة": 1729,
      "ُط": 1730,
      "ُذ": 1731,
      "ْنِي": 1732,
      "▁عب": 1733,
      "▁حكم": 1734,
      "▁مق": 1735,
      "▁أعلم": 1736,
      "▁وقال:": 1737,
      "▁فلما": 1738,
      "▁سي": 1739,
      "لائ": 1740,
      "▁جميع": 1741,
      "▁بذلك": 1742,
      "▁إِن": 1743,
      "كام": 1744,
      "▁بخ": 1745,
      "▁أول": 1746,
      "لية": 1747,
      "كت": 1748,
      "َدُ": 1749,
      "▁ذا": 1750,
      "▁والث": 1751,
      "▁واست": 1752,
      "▁لت": 1753,
      "رمذي": 1754,
      "فعل": 1755,
      "▁صاحب": 1756,
      "▁أرب": 1757,
      "▁وعلى": 1758,
      "▁مَس": 1759,
      "▁وَلاَ": 1760,
      "▁لِي": 1761,
      "▁إسحاق": 1762,
      "▁ذكره": 1763,
      "علم": 1764,
      "ملة": 1765,
      "اية": 1766,
      "▁يقول:": 1767,
      "▁بَعْض": 1768,
      "ناد": 1769,
      "▁إِلا": 1770,
      "ُت": 1771,
      "▁وإذا": 1772,
      "▁نس": 1773,
      "زُ": 1774,
      "▁شرح": 1775,
      "▁العرب": 1776,
      "ءِ": 1777,
      "سين": 1778,
      "▁يب": 1779,
      "▁بني": 1780,
      "▁اللَّهَ": 1781,
      "▁٢٤": 1782,
      "▁بق": 1783,
      "دل": 1784,
      "ثبت": 1785,
      "ويل": 1786,
      "▁ومع": 1787,
      "َبِ": 1788,
      "▁الحكم": 1789,
      "ع،": 1790,
      "▁شيئ": 1791,
      "رت": 1792,
      "▁هم": 1793,
      "فه": 1794,
      "بيه": 1795,
      "▁العل": 1796,
      "ر،": 1797,
      "▁الزَّ": 1798,
      "ّه": 1799,
      "▁(٢/": 1800,
      "ِيف": 1801,
      "ُض": 1802,
      "▁الْي": 1803,
      "ِش": 1804,
      "▁وليس": 1805,
      "دع": 1806,
      "▁فَت": 1807,
      "▁خير": 1808,
      "▁والش": 1809,
      "▁٢٥": 1810,
      "اله": 1811,
      "هم.": 1812,
      "مش": 1813,
      "▁يَنْ": 1814,
      "▁٣/": 1815,
      "ذَلِكَ": 1816,
      "ُرْ": 1817,
      "▁ورو": 1818,
      "▁ات": 1819,
      "▁رَضِيَ": 1820,
      "▁تص": 1821,
      "▁فس": 1822,
      "▁صد": 1823,
      "▁تكون": 1824,
      "َلُ": 1825,
      "▁وقيل:": 1826,
      "▁جَم": 1827,
      "َّع": 1828,
      "نب": 1829,
      "فار": 1830,
      "َتِهِ": 1831,
      "ِئ": 1832,
      "▁هرير": 1833,
      "▁٢٧": 1834,
      "▁السُّ": 1835,
      "▁الكلام": 1836,
      "▁يص": 1837,
      "▁الْآ": 1838,
      "ثل": 1839,
      "▁الدنيا": 1840,
      "▁لكن": 1841,
      "▁المج": 1842,
      "▁فَلَا": 1843,
      "▁المست": 1844,
      "▁وَكَانَ": 1845,
      "▁لع": 1846,
      "▁وذكر": 1847,
      "سْلِم": 1848,
      "َّار": 1849,
      "▁شَيْء": 1850,
      "▁رَأ": 1851,
      "▁نحو": 1852,
      "رات": 1853,
      "دم": 1854,
      "▁٢٨": 1855,
      "ِط": 1856,
      "▁الأس": 1857,
      "ُث": 1858,
      "▁يُع": 1859,
      "ُهُ:": 1860,
      "داد": 1861,
      "▁والب": 1862,
      "َرْض": 1863,
      "ٍ:": 1864,
      "--": 1865,
      "▁بِهَا": 1866,
      "َعِيد": 1867,
      "▁أَس": 1868,
      "▁خلق": 1869,
      "▁وَا": 1870,
      "▁قوم": 1871,
      "▁إِلَيْهِ": 1872,
      "▁وَاحِد": 1873,
      "▁حدث": 1874,
      "▁قالوا": 1875,
      "حدث": 1876,
      "ذاب": 1877,
      "▁(٦": 1878,
      "ِيُّ،": 1879,
      "ُوم": 1880,
      "▁أَك": 1881,
      "مات": 1882,
      "أل": 1883,
      "▁٢٦": 1884,
      "نع": 1885,
      "▁فَقَالَ:": 1886,
      "▁عَبْدُ": 1887,
      "▁كَال": 1888,
      "▁أَق": 1889,
      "▁تَح": 1890,
      "يام": 1891,
      "▁إذَا": 1892,
      "▁كتب": 1893,
      "ظهر": 1894,
      "ؤْم": 1895,
      "▁والج": 1896,
      "▁وسلم-": 1897,
      "شد": 1898,
      "عود": 1899,
      "▁وَنَ": 1900,
      "▁{ف": 1901,
      "▁والك": 1902,
      "▁سَمِع": 1903,
      "سند": 1904,
      "انِي": 1905,
      "َّه": 1906,
      "▁مُع": 1907,
      "كة": 1908,
      "▁=": 1909,
      "اذ": 1910,
      "▁الرا": 1911,
      "▁مؤ": 1912,
      "▁وَلَوْ": 1913,
      "نَى": 1914,
      "ْتُمْ": 1915,
      "ونه": 1916,
      "َعُ": 1917,
      "▁مات": 1918,
      "ْدِ": 1919,
      "▁حَق": 1920,
      "ضاء": 1921,
      "واه": 1922,
      "▁(ب": 1923,
      "ان:": 1924,
      "وء": 1925,
      "سة": 1926,
      "َدِ": 1927,
      "اك": 1928,
      "▁لله": 1929,
      "▁(٦)": 1930,
      "▁فَك": 1931,
      "لَّهِ": 1932,
      "مير": 1933,
      "▁هَذِهِ": 1934,
      "▁المد": 1935,
      "▁يزيد": 1936,
      "▁والخ": 1937,
      "لاح": 1938,
      "▁رَو": 1939,
      "▁ترك": 1940,
      "ظيم": 1941,
      "حتاج": 1942,
      "عيف": 1943,
      "▁والق": 1944,
      "▁٢٩": 1945,
      "يع": 1946,
      "▁والص": 1947,
      "لاد": 1948,
      "▁وبين": 1949,
      "▁عائ": 1950,
      "َدِّ": 1951,
      "بيل": 1952,
      "▁تك": 1953,
      "▁خَل": 1954,
      "▁وسلم:": 1955,
      "▁انتهى": 1956,
      "▁٣٠": 1957,
      "جة": 1958,
      "َقَ": 1959,
      "▁به.": 1960,
      "تك": 1961,
      "▁الَّتِي": 1962,
      "ٍ.": 1963,
      "▁ألف": 1964,
      "▁وط": 1965,
      "▁فن": 1966,
      "▁أخبرنا": 1967,
      "▁وَلَمْ": 1968,
      "▁رِ": 1969,
      "٧]": 1970,
      "▁كذا": 1971,
      "▁نع": 1972,
      "▁عبيد": 1973,
      "وائ": 1974,
      "مائ": 1975,
      "▁وله": 1976,
      "افر": 1977,
      "▁يَأ": 1978,
      "▁(ع": 1979,
      "َابُ": 1980,
      "▁أكثر": 1981,
      "▁الشاف": 1982,
      "ناء": 1983,
      "▁الأولى": 1984,
      "ضاف": 1985,
      "َاك": 1986,
      "دينة": 1987,
      "▁((": 1988,
      "▁بالأ": 1989,
      "ألة": 1990,
      "ُز": 1991,
      "شة": 1992,
      "ذن": 1993,
      "▁وآ": 1994,
      "▁بمعنى": 1995,
      "ماعة": 1996,
      "َيْل": 1997,
      "▁بِمَا": 1998,
      "▁أَج": 1999,
      "▁الِ": 2000,
      "▁والس": 2001,
      "عام": 2002,
      "▁المش": 2003,
      "▁أنها": 2004,
      "▁وَص": 2005,
      "امع": 2006,
      "▁مِث": 2007,
      "▁كانوا": 2008,
      "ختلف": 2009,
      "▁عُمَرَ": 2010,
      "فص": 2011,
      "اتم": 2012,
      "َبُ": 2013,
      "▁\"و": 2014,
      "س،": 2015,
      "▁رَسُولَ": 2016,
      "▁الْحَن": 2017,
      "▁الأص": 2018,
      "▁))": 2019,
      "▁بَك": 2020,
      "▁الأع": 2021,
      "اعة": 2022,
      "ِلَ": 2023,
      "ِرِ": 2024,
      "▁الرَّحْم": 2025,
      "▁ملك": 2026,
      "▁بقوله": 2027,
      "▁وهم": 2028,
      "▁إِب": 2029,
      "▁المعنى": 2030,
      "يرة": 2031,
      "▁وَالْح": 2032,
      "▁زي": 2033,
      "▁النِّ": 2034,
      "▁وكذلك": 2035,
      "▁٣١": 2036,
      "▁جعفر": 2037,
      "▁تفسير": 2038,
      "▁مُحَمَّدُ": 2039,
      "▁الصح": 2040,
      "ؤْمِن": 2041,
      "ِّب": 2042,
      "ابت": 2043,
      "▁القاسم": 2044,
      "غي": 2045,
      "هور": 2046,
      "▁انظر:": 2047,
      "ثُ": 2048,
      "َلِك": 2049,
      "▁عق": 2050,
      "َامُ": 2051,
      "أنه": 2052,
      "▁تت": 2053,
      "▁مد": 2054,
      "ابع": 2055,
      "▁تَك": 2056,
      "▁تج": 2057,
      "▁أَخْبَرَنَا": 2058,
      "بيع": 2059,
      "▁فج": 2060,
      "َادَ": 2061,
      "▁نز": 2062,
      "▁بط": 2063,
      "بري": 2064,
      "له،": 2065,
      "▁٤/": 2066,
      "▁خط": 2067,
      "▁جعل": 2068,
      "▁سبحانه": 2069,
      "َفَ": 2070,
      "▁مِم": 2071,
      "▁نَفْس": 2072,
      "▁به،": 2073,
      "▁أه": 2074,
      "ِلا": 2075,
      "▁بالن": 2076,
      "ب،": 2077,
      "▁نص": 2078,
      "▁(م": 2079,
      "َامَ": 2080,
      "▁الدُّ": 2081,
      "وسف": 2082,
      "ٌ.": 2083,
      "▁تلك": 2084,
      "ون،": 2085,
      "رام": 2086,
      "َانُ": 2087,
      "▁وجل": 2088,
      "هود": 2089,
      "▁تخ": 2090,
      "عمال": 2091,
      "▁رحمه": 2092,
      "▁أبى": 2093,
      "▁إنه": 2094,
      "▁سليمان": 2095,
      "يز": 2096,
      "▁نفسه": 2097,
      "فَ": 2098,
      "خرجه": 2099,
      "▁عثمان": 2100,
      "ّ،": 2101,
      "ية.": 2102,
      "▁والد": 2103,
      "هار": 2104,
      "ْرَ": 2105,
      "ق،": 2106,
      "▁لَيْسَ": 2107,
      "يبة": 2108,
      "▁كذلك": 2109,
      "هن": 2110,
      "▁رَجُل": 2111,
      "▁موضع": 2112,
      "▁صالح": 2113,
      "▁وَإِ": 2114,
      "▁الْمَال": 2115,
      "▁ذلك،": 2116,
      "َذَلِكَ": 2117,
      "رفة": 2118,
      "َمَّ": 2119,
      "▁با": 2120,
      "َافِ": 2121,
      "▁إِلاَّ": 2122,
      "▁(ص": 2123,
      "▁لِأَنَّهُ": 2124,
      "▁٣٢": 2125,
      "ينة": 2126,
      "▁٣٣": 2127,
      "ماعيل": 2128,
      "▁ذَك": 2129,
      "راج": 2130,
      "▁خمس": 2131,
      "▁امر": 2132,
      "▁أخذ": 2133,
      "▁الحافظ": 2134,
      "قدير": 2135,
      "▁يُح": 2136,
      "▁قر": 2137,
      "▁صف": 2138,
      "▁عَد": 2139,
      "▁بالت": 2140,
      "راءة": 2141,
      "َتِ": 2142,
      "▁الأخ": 2143,
      "▁يل": 2144,
      "دت": 2145,
      "▁لفظ": 2146,
      "شرح": 2147,
      "▁وَقَال": 2148,
      "صور": 2149,
      "▁أُم": 2150,
      ".\"": 2151,
      "راف": 2152,
      "ْرَاه": 2153,
      "ُوزُ": 2154,
      "▁\"م": 2155,
      "▁الشَّي": 2156,
      "▁-صلى": 2157,
      "حن": 2158,
      "َلِّ": 2159,
      "▁فما": 2160,
      "▁إلَّا": 2161,
      "َهُوَ": 2162,
      "َهُ،": 2163,
      "زيز": 2164,
      "▁يَص": 2165,
      "فل": 2166,
      "َيْب": 2167,
      "▁التع": 2168,
      "ريف": 2169,
      "ليه": 2170,
      "▁سَعِيد": 2171,
      "▁الْمَس": 2172,
      "ِرُ": 2173,
      "ِيهِ": 2174,
      "▁كُن": 2175,
      "▁وقت": 2176,
      "٨]": 2177,
      "▁مال": 2178,
      "▁مخ": 2179,
      "▁الكبير": 2180,
      "▁المنا": 2181,
      "مته": 2182,
      "▁فض": 2183,
      "ْنُ": 2184,
      "▁٣٤": 2185,
      "▁الحا": 2186,
      "▁اس": 2187,
      "▁وفيه": 2188,
      "ِذ": 2189,
      "▁الصحيح": 2190,
      "▁[٥]": 2191,
      "يلة": 2192,
      "▁لن": 2193,
      "بات": 2194,
      "▁وَهَذَا": 2195,
      "َرَج": 2196,
      "▁لِم": 2197,
      "▁الشَّافِع": 2198,
      "ان.": 2199,
      "فاء": 2200,
      "▁فمن": 2201,
      "ُوهُ": 2202,
      "مار": 2203,
      "َفْع": 2204,
      "علق": 2205,
      "قول:": 2206,
      "▁(٧": 2207,
      "ونَ": 2208,
      "ْش": 2209,
      "▁النَّبِيِّ": 2210,
      "ؤلاء": 2211,
      "▁مِنْهَا": 2212,
      "هي": 2213,
      "▁بش": 2214,
      "▁أنس": 2215,
      "ْرَأ": 2216,
      "١.": 2217,
      "▁فَال": 2218,
      "▁٣٥": 2219,
      "حب": 2220,
      "▁بنُ": 2221,
      "▁ار": 2222,
      "▁يَخ": 2223,
      "ضا": 2224,
      "ِيرِ": 2225,
      "امل": 2226,
      "▁أَر": 2227,
      "▁اج": 2228,
      "ِز": 2229,
      "رقم": 2230,
      "ماد": 2231,
      "ولي": 2232,
      "▁الماء": 2233,
      "َعْنَى": 2234,
      "▁عليه،": 2235,
      "يار": 2236,
      "▁بغ": 2237,
      "َ:": 2238,
      "▁سفي": 2239,
      "▁أيضا": 2240,
      "▁وتع": 2241,
      "ِّل": 2242,
      "ذف": 2243,
      "▁سمعت": 2244,
      "▁الجمع": 2245,
      "▁أَمْ": 2246,
      "ُمُ": 2247,
      "سط": 2248,
      "▁لمن": 2249,
      "َاةِ": 2250,
      "▁ـ": 2251,
      "صة": 2252,
      "قرة": 2253,
      "ها:": 2254,
      "▁جز": 2255,
      "َسَن": 2256,
      "▁هل": 2257,
      "▁أراد": 2258,
      "▁تم": 2259,
      "▁آخ": 2260,
      "راب": 2261,
      "▁خبر": 2262,
      "وّ": 2263,
      "ِلْك": 2264,
      "▁المق": 2265,
      "▁فتح": 2266,
      "▁فكان": 2267,
      "ْتَم": 2268,
      "ِّين": 2269,
      "▁الإنسان": 2270,
      "ابر": 2271,
      "▁ير": 2272,
      "▁لَهُمْ": 2273,
      "▁الجز": 2274,
      "▁بهذا": 2275,
      "٢.": 2276,
      "حل": 2277,
      "ارث": 2278,
      "▁اع": 2279,
      "▁[١].": 2280,
      "▁حاتم": 2281,
      "▁المط": 2282,
      "▁شع": 2283,
      "▁إِذا": 2284,
      "▁مَالِك": 2285,
      "سبة": 2286,
      "ال،": 2287,
      "▁هريرة": 2288,
      "َّن": 2289,
      "ءُ": 2290,
      "▁أَش": 2291,
      "▁خرج": 2292,
      "سا": 2293,
      "▁بر": 2294,
      "▁(قَوْل": 2295,
      "▁يوسف": 2296,
      "وجه": 2297,
      "َارَ": 2298,
      "ري،": 2299,
      "▁وَسَلَّمَ:": 2300,
      "▁آية": 2301,
      "▁؟": 2302,
      "▁(ت": 2303,
      "َّةَ": 2304,
      "▁اهـ": 2305,
      "ِّف": 2306,
      "▁وَمِنْ": 2307,
      "ِبِ": 2308,
      "▁ولي": 2309,
      "▁أت": 2310,
      "▁٣٦": 2311,
      "▁لنا": 2312,
      "▁الدار": 2313,
      "ُونَ}": 2314,
      "▁ضعيف": 2315,
      "ِرَ": 2316,
      "٣.": 2317,
      "▁محم": 2318,
      "ى:": 2319,
      "▁لَهَا": 2320,
      "▁شيخ": 2321,
      "فرد": 2322,
      "ي:": 2323,
      "▁المراد": 2324,
      "▁يعلم": 2325,
      "..": 2326,
      "ْرِي": 2327,
      "▁بعضهم": 2328,
      "▁ولد": 2329,
      "حاديث": 2330,
      "ُؤ": 2331,
      "ضًا": 2332,
      "رجع": 2333,
      "▁الثالث": 2334,
      "▁أر": 2335,
      "ين:": 2336,
      "ضة": 2337,
      "ولا": 2338,
      "▁لب": 2339,
      "َّي": 2340,
      "رّ": 2341,
      "قدر": 2342,
      "وَاي": 2343,
      "▁الأح": 2344,
      "▁الساب": 2345,
      "▁فَهُوَ": 2346,
      "ِيرُ": 2347,
      "▁الصَّل": 2348,
      "▁ام": 2349,
      "▁وحد": 2350,
      "▁الرُّ": 2351,
      "شام": 2352,
      "ِى": 2353,
      "َيْت": 2354,
      "▁بِح": 2355,
      "ُنْ": 2356,
      "▁إنْ": 2357,
      "▁يَكُونَ": 2358,
      "▁العزيز": 2359,
      "▁الترمذي": 2360,
      "▁بِع": 2361,
      "ْهِ": 2362,
      "٥.": 2363,
      "▁فَم": 2364,
      "تمل": 2365,
      "▁عط": 2366,
      "▁تَر": 2367,
      "مَن": 2368,
      "لّى": 2369,
      "▁تاريخ": 2370,
      "▁سَل": 2371,
      "ّي": 2372,
      "٩]": 2373,
      "▁الجنة": 2374,
      "ِمَ": 2375,
      "٧.": 2376,
      "▁اخْت": 2377,
      "٨.": 2378,
      "▁العربي": 2379,
      "▁فَإِنَّهُ": 2380,
      "َابِل": 2381,
      "٩.": 2382,
      "▁المك": 2383,
      "▁وَإِنَّ": 2384,
      "َئ": 2385,
      "▁إِبْرَاه": 2386,
      "٤.": 2387,
      "▁عنها": 2388,
      "▁أحدهما": 2389,
      "▁وَالْأ": 2390,
      "واز": 2391,
      "▁دع": 2392,
      "▁مَك": 2393,
      "بلغ": 2394,
      "قَ": 2395,
      "قوب": 2396,
      "َيْنَ": 2397,
      "٦.": 2398,
      "▁فَس": 2399,
      "فى": 2400,
      "▁عَبَّاس": 2401,
      "ُقَهَا": 2402,
      "▁أنهم": 2403,
      "٠.": 2404,
      "ِّهِ": 2405,
      "َى،": 2406,
      "▁مُت": 2407,
      "▁نعم": 2408,
      "▁حك": 2409,
      "▁غيره": 2410,
      "حْو": 2411,
      "َدُّ": 2412,
      "▁فر": 2413,
      "باح": 2414,
      "▁شاء": 2415,
      "شرك": 2416,
      "▁أَل": 2417,
      "▁أَت": 2418,
      "▁تَعَالَى:": 2419,
      "يمة": 2420,
      "حمل": 2421,
      "قا": 2422,
      "▁صلّى": 2423,
      "ِعُ": 2424,
      "َرْضِ": 2425,
      "مِ": 2426,
      "▁إسماعيل": 2427,
      "▁يَش": 2428,
      "فعول": 2429,
      "▁يَب": 2430,
      "▁قاله": 2431,
      "▁الشافعي": 2432,
      "ائع": 2433,
      "ريح": 2434,
      "قى": 2435,
      "▁مب": 2436,
      "َكُمْ": 2437,
      "▁\"ت": 2438,
      "▁الشَّر": 2439,
      "َلَاث": 2440,
      "هذيب": 2441,
      "▁يُر": 2442,
      "ولة": 2443,
      "ِيدُ": 2444,
      "▁الأش": 2445,
      "هاد": 2446,
      "ِج": 2447,
      "▁بالإ": 2448,
      "▁مَح": 2449,
      "ْغ": 2450,
      "▁بَل": 2451,
      "مد": 2452,
      "▁البيت": 2453,
      "▁اللّ": 2454,
      "▁ست": 2455,
      "هاء": 2456,
      "▁صح": 2457,
      "قِ": 2458,
      "عون": 2459,
      "▁غَيْرِ": 2460,
      "كذا": 2461,
      "▁والط": 2462,
      "▁أَف": 2463,
      "▁٣٧": 2464,
      "▁يغ": 2465,
      "▁قرأ": 2466,
      "وضع": 2467,
      "سه": 2468,
      "▁فِيمَا": 2469,
      "▁النار": 2470,
      "▁(٣/": 2471,
      "١]": 2472,
      "ُوج": 2473,
      "٠]": 2474,
      "ير،": 2475,
      "َابَ": 2476,
      "▁يجب": 2477,
      "ِلُ": 2478,
      "الي": 2479,
      "َرْج": 2480,
      "خبر": 2481,
      "عمل": 2482,
      "▁ومسلم": 2483,
      "▁ثلاثة": 2484,
      "َهَبَ": 2485,
      "▁معا": 2486,
      "ُّب": 2487,
      "▁وعبد": 2488,
      "▁الإس": 2489,
      "ْلَ": 2490,
      "▁امرأ": 2491,
      "▁قَت": 2492,
      "▁اعت": 2493,
      "َاش": 2494,
      "ْأَل": 2495,
      "▁صَح": 2496,
      "عُ": 2497,
      "▁المغ": 2498,
      "قُ": 2499,
      "عِ": 2500,
      "▁بنت": 2501,
      "▁خلاف": 2502,
      "َالُ": 2503,
      "▁لح": 2504,
